

// THIS FILE IS GENERATED AUTOMATICALLY
// Don't edit this file by hand. 
// Edit the build located in the faucet-wasm folder.

let scrypt, mine;
let scryptPromise;

module.exports = {
  getScrypt: function() { return scrypt; },
  getScryptMine: function() { return mine; },
  getScryptReadyPromise: function() { return scryptPromise; }
};


var base32768 = (function (exports) {
  'use strict';

  /**
    Base32768 is a binary-to-text encoding optimised for UTF-16-encoded text.
    (e.g. Windows, Java, JavaScript)
  */

  // Z is a number, usually a uint15 but sometimes a uint7

  const BITS_PER_CHAR = 15; // Base32768 is a 15-bit encoding
  const BITS_PER_BYTE = 8;

  // Base32768 uses blocks of 32 characters.
  const blockSize = 1 << 5;
  const repertoires = [
    'ҠԀڀڠݠހ߀ကႠᄀᄠᅀᆀᇠሀሠበዠጠᎠᏀᐠᑀᑠᒀᒠᓀᓠᔀᔠᕀᕠᖀᖠᗀᗠᘀᘠᙀᚠᛀកᠠᡀᣀᦀ᧠ᨠᯀᰀᴀ⇠⋀⍀⍠⎀⎠⏀␀─┠╀╠▀■◀◠☀☠♀♠⚀⚠⛀⛠✀✠❀➀➠⠀⠠⡀⡠⢀⢠⣀⣠⤀⤠⥀⥠⦠⨠⩀⪀⪠⫠⬀⬠⭀ⰀⲀⲠⳀⴀⵀ⺠⻀㇀㐀㐠㑀㑠㒀㒠㓀㓠㔀㔠㕀㕠㖀㖠㗀㗠㘀㘠㙀㙠㚀㚠㛀㛠㜀㜠㝀㝠㞀㞠㟀㟠㠀㠠㡀㡠㢀㢠㣀㣠㤀㤠㥀㥠㦀㦠㧀㧠㨀㨠㩀㩠㪀㪠㫀㫠㬀㬠㭀㭠㮀㮠㯀㯠㰀㰠㱀㱠㲀㲠㳀㳠㴀㴠㵀㵠㶀㶠㷀㷠㸀㸠㹀㹠㺀㺠㻀㻠㼀㼠㽀㽠㾀㾠㿀㿠䀀䀠䁀䁠䂀䂠䃀䃠䄀䄠䅀䅠䆀䆠䇀䇠䈀䈠䉀䉠䊀䊠䋀䋠䌀䌠䍀䍠䎀䎠䏀䏠䐀䐠䑀䑠䒀䒠䓀䓠䔀䔠䕀䕠䖀䖠䗀䗠䘀䘠䙀䙠䚀䚠䛀䛠䜀䜠䝀䝠䞀䞠䟀䟠䠀䠠䡀䡠䢀䢠䣀䣠䤀䤠䥀䥠䦀䦠䧀䧠䨀䨠䩀䩠䪀䪠䫀䫠䬀䬠䭀䭠䮀䮠䯀䯠䰀䰠䱀䱠䲀䲠䳀䳠䴀䴠䵀䵠䶀䷀䷠一丠乀习亀亠什仠伀传佀你侀侠俀俠倀倠偀偠傀傠僀僠儀儠兀兠冀冠净几刀删剀剠劀加勀勠匀匠區占厀厠叀叠吀吠呀呠咀咠哀哠唀唠啀啠喀喠嗀嗠嘀嘠噀噠嚀嚠囀因圀圠址坠垀垠埀埠堀堠塀塠墀墠壀壠夀夠奀奠妀妠姀姠娀娠婀婠媀媠嫀嫠嬀嬠孀孠宀宠寀寠尀尠局屠岀岠峀峠崀崠嵀嵠嶀嶠巀巠帀帠幀幠庀庠廀廠开张彀彠往徠忀忠怀怠恀恠悀悠惀惠愀愠慀慠憀憠懀懠戀戠所扠技抠拀拠挀挠捀捠掀掠揀揠搀搠摀摠撀撠擀擠攀攠敀敠斀斠旀无昀映晀晠暀暠曀曠最朠杀杠枀枠柀柠栀栠桀桠梀梠检棠椀椠楀楠榀榠槀槠樀樠橀橠檀檠櫀櫠欀欠歀歠殀殠毀毠氀氠汀池沀沠泀泠洀洠浀浠涀涠淀淠渀渠湀湠満溠滀滠漀漠潀潠澀澠激濠瀀瀠灀灠炀炠烀烠焀焠煀煠熀熠燀燠爀爠牀牠犀犠狀狠猀猠獀獠玀玠珀珠琀琠瑀瑠璀璠瓀瓠甀甠畀畠疀疠痀痠瘀瘠癀癠皀皠盀盠眀眠着睠瞀瞠矀矠砀砠础硠碀碠磀磠礀礠祀祠禀禠秀秠稀稠穀穠窀窠竀章笀笠筀筠简箠節篠簀簠籀籠粀粠糀糠紀素絀絠綀綠緀締縀縠繀繠纀纠绀绠缀缠罀罠羀羠翀翠耀耠聀聠肀肠胀胠脀脠腀腠膀膠臀臠舀舠艀艠芀芠苀苠茀茠荀荠莀莠菀菠萀萠葀葠蒀蒠蓀蓠蔀蔠蕀蕠薀薠藀藠蘀蘠虀虠蚀蚠蛀蛠蜀蜠蝀蝠螀螠蟀蟠蠀蠠血衠袀袠裀裠褀褠襀襠覀覠觀觠言訠詀詠誀誠諀諠謀謠譀譠讀讠诀诠谀谠豀豠貀負賀賠贀贠赀赠趀趠跀跠踀踠蹀蹠躀躠軀軠輀輠轀轠辀辠迀迠退造遀遠邀邠郀郠鄀鄠酀酠醀醠釀釠鈀鈠鉀鉠銀銠鋀鋠錀錠鍀鍠鎀鎠鏀鏠鐀鐠鑀鑠钀钠铀铠销锠镀镠門閠闀闠阀阠陀陠隀隠雀雠需霠靀靠鞀鞠韀韠頀頠顀顠颀颠飀飠餀餠饀饠馀馠駀駠騀騠驀驠骀骠髀髠鬀鬠魀魠鮀鮠鯀鯠鰀鰠鱀鱠鲀鲠鳀鳠鴀鴠鵀鵠鶀鶠鷀鷠鸀鸠鹀鹠麀麠黀黠鼀鼠齀齠龀龠ꀀꀠꁀꁠꂀꂠꃀꃠꄀꄠꅀꅠꆀꆠꇀꇠꈀꈠꉀꉠꊀꊠꋀꋠꌀꌠꍀꍠꎀꎠꏀꏠꐀꐠꑀꑠ꒠ꔀꔠꕀꕠꖀꖠꗀꗠꙀꚠꛀ꜀꜠ꝀꞀꡀ', // length = 1 << 10
    'ƀɀɠʀ' // length = 1 << 2
  ];

  const lookupE = {};
  repertoires.forEach((repertoire, r) => {
    const numZBits = BITS_PER_CHAR - BITS_PER_BYTE * r; // 0 -> 15, 1 -> 7
    const encodeRepertoire = [];
    for (let i = 0; i < repertoire.length; i++) {
      const charCode = repertoire.charCodeAt(i);
      for (let offset = 0; offset < blockSize; offset++) {
        encodeRepertoire.push(String.fromCharCode(charCode + offset));
      }
    }
    lookupE[numZBits] = encodeRepertoire;
  });

  const lookupD = {};
  Object.entries(lookupE).forEach(([numZBits, encodeRepertoire]) => {
    encodeRepertoire.forEach((chr, z) => {
      lookupD[chr] = [Number(numZBits), z];
    });
  });

  const encode = uint8Array => {
    const length = uint8Array.length;

    let str = '';
    let z = 0;
    let numZBits = 0;

    for (let i = 0; i < length; i++) {
      const uint8 = uint8Array[i];

      // Take most significant bit first
      for (let j = BITS_PER_BYTE - 1; j >= 0; j--) {
        const bit = (uint8 >> j) & 1;

        z = (z << 1) + bit;
        numZBits++;

        if (numZBits === BITS_PER_CHAR) {
          str += lookupE[numZBits][z];
          z = 0;
          numZBits = 0;
        }
      }
    }

    if (numZBits !== 0) {
      // Final bits require special treatment.

      // z = bbbbbbcccccccc, numZBits = 14, padBits = 1
      // z = bbbbbcccccccc, numZBits = 13, padBits = 2
      // z = bbbbcccccccc, numZBits = 12, padBits = 3
      // z = bbbcccccccc, numZBits = 11, padBits = 4
      // z = bbcccccccc, numZBits = 10, padBits = 5
      // z = bcccccccc, numZBits = 9, padBits = 6
      // z = cccccccc, numZBits = 8, padBits = 7
      // => Pad `z` out to 15 bits using 1s, then encode as normal (r = 0)

      // z = ccccccc, numZBits = 7, padBits = 0
      // z = cccccc, numZBits = 6, padBits = 1
      // z = ccccc, numZBits = 5, padBits = 2
      // z = cccc, numZBits = 4, padBits = 3
      // z = ccc, numZBits = 3, padBits = 4
      // z = cc, numZBits = 2, padBits = 5
      // z = c, numZBits = 1, padBits = 6
      // => Pad `z` out to 7 bits using 1s, then encode specially (r = 1)

      while (!(numZBits in lookupE)) {
        z = (z << 1) + 1;
        numZBits++;
      }

      str += lookupE[numZBits][z];
    }

    return str
  };

  const decode = str => {
    const length = str.length;

    // This length is a guess. There's a chance we allocate one more byte here
    // than we actually need. But we can count and slice it off later
    const uint8Array = new Uint8Array(Math.floor(length * BITS_PER_CHAR / BITS_PER_BYTE));
    let numUint8s = 0;
    let uint8 = 0;
    let numUint8Bits = 0;

    for (let i = 0; i < length; i++) {
      const chr = str.charAt(i);

      if (!(chr in lookupD)) {
        throw new Error(`Unrecognised Base32768 character: ${chr}`)
      }

      const [numZBits, z] = lookupD[chr];

      if (numZBits !== BITS_PER_CHAR && i !== length - 1) {
        throw new Error('Secondary character found before end of input at position ' + String(i))
      }

      // Take most significant bit first
      for (let j = numZBits - 1; j >= 0; j--) {
        const bit = (z >> j) & 1;

        uint8 = (uint8 << 1) + bit;
        numUint8Bits++;

        if (numUint8Bits === BITS_PER_BYTE) {
          uint8Array[numUint8s] = uint8;
          numUint8s++;
          uint8 = 0;
          numUint8Bits = 0;
        }
      }
    }

    // Final padding bits! Requires special consideration!
    // Remember how we always pad with 1s?
    // Note: there could be 0 such bits, check still works though
    if (uint8 !== ((1 << numUint8Bits) - 1)) {
      throw new Error('Padding mismatch')
    }

    return new Uint8Array(uint8Array.buffer, 0, numUint8s)
  };

  exports.decode = decode;
  exports.encode = encode;

  return exports;

}({}));


const base32768WASM = "Ԑ茻䙠ҠҬ婤䴀Ꮏ无㹀癏陷ꆠᨼᑾ虣星蘠噌ԗꊛꊡ晢Ꙁ噢䘟陏陦ԃ꒽ꗾᅟ噠蘠嘬ڗꊛ꒽ꔀ虠Ԑᆟ陏鹗ꊘᆀ㔾ꜟ星蘿虬ݷꊛ꒽ꗾꜟ无㹃㘯鹗ꊛ꒽ꗾꜟ无㹀ԏ鱠剛꒽ꗾᅟ噣蘿陏鹗ꊘᨽ晤ꕿޟ朾疀Ԁ纐幤⠆㙇⋁楠ҠҠҨ㺄ҠᒒᏀᄣ蛠ڀ湠㙐ҢҤᒂڀ䛠暠湠ҠҨႠᒀ晠䚀囐䙀ҴҴҢݡҡ䛠嚠Ұ■ቢ⎠Ⴀ暠䙠Ԁ▰■ᖂႡݡڀ暠䙠ҠҠቦႡႡቢႠ皠乫晤暠ᛃݠᗁ枀㸰⠌ባҠ⤇懣査匍絗㨈■Ⲧ角挘䍀ᄠ洶燓㩀◞薿我䂛独鲶饛ᣑ漞髏嘙荸勍屗ᓻ䯹輪顠壨縷镌䳖馃䏕茞鏁岖䈘虨瞅ꆛ菩礼談夗㸜猌㴆觛⪡㱞薿我䂛独鲶饛䀉焪ڔᘒ暠◀㛱ꅛ㠡獐泃䋼㕖䵉㶗墰黸ꖴ麜国㪘焫榷樘兢呤ꁳ䕀矿詠በ⛠က橦杸恰ߐ䝎橸ᖇ陽襄䙃䛄䏐噿蚗⚠Ⳅ坌飒㝁湠䭀ᕂ㙢ᗡ躠ᗁᖺ㚠㙟曗⦱ұተ鲡曟ߜ䩀橱樓瀨橨杮懰Ⴐ䥮鶒Ԃᖍ鍆邀ݴҩᗀ穱樁ҵተ骡暠敡钎䡀偨䠙ᒁꔃ廰ᄰ䥎趇㝐軠ጰҠ㝂皦㓄ڔ◣睦Ⴁꊧ弙□亁┄⪧鹭袠ᠡ⫻䋜檡衠⛠Ұ橪杸恰ᄰ䝎橸ᖇ陽襄䙅䛄䏐噿蚗⚠㭄坌飒㝅㚃畄ބ♫萬晴杣憙胺橠婰ꉙҭቺ鷓㙁皢甮崂㙩Ҥ癠䉢ᄀ汽ᖀ䩐樂ᯂሸ┑彰ݰ䝎詸▐㐄晤杸憙䋈棄Ҳ晡ݨᘂ㺴㙁㚂㓈㹈▀䐅誠ጡᖻ㚠䘀嵲Ҳᗡ鍄颂⠠槽詢橱爛狠仢ᓶ怕䃈ԅҡ䝐⚤坈䙂䛄䍐噰㘀懫滠ᘂ☖䜀无钄Ԅ♣耩誤㵠ݴҦᗀ䩑樁ҩተ骡暠敡钎䡀㡈䠙ᒁꔃ廰ݰ䥎趇㝑潤䌮䙲䛌萼試䩐䇳琈晦邀ݴҬᗀ䩑樁ҩተ骡暠敡钎䡀㡈䠙ᒁꔃ廰ݰ䥎趇㝐鋠ጰҬ㝁㚆㓄Ԅ◣睦Ⴁꊧ弙■溁┄⪧鹭袠ጡ⫻䋜檡塠⛠ڀ橤杸恰ݰ䝎橸ᖇ陽襄䙂䛄䏐噿蚗⚠⚤坌飒㝆㚃畄߄♫萬晸杣憙胺橠㣀ᄡ▩ደ骀ᄀ桽◐▯蚛氨晤杨憀蚟曎㡀㡈蠹譄䡯㙀灠Ⴄ䙤♣盠ᘂ☔䜀䙿ဎ㵢Ҳᖡ鋣သᇸ湠溃┇㧑◕ቼ鶀⍀沽铄ߔ▻耬晴郊㙂㚃镄ڄ☋萬晨杪憙胨暨㜷彠⚤䄮馀ᄀ棽瓍䡠恨搼普杭戙湡躁䷇䆑▹ቾ鶀ᒠ榽铄ڤ◳耭窤✊㙀灠⋄䛄♣盠㛂☔䜀䙿ဎ㵢ڂᖡ鋣သᇸ湢◃┇㧑♭ቼ鶀㿠沽铄ᒴ▻耬暖邀ᒵ■䭀ᑂ㙊ᗡ躠ᄡᖺ㚠㙟曗⦱ҥተ鲡曟ߜ䩀㩑樓瀨櫀杮懰⪰䥮鶒ᆂᖍ鍆䙯孰ሚ橣䩐騙کዲ鷓㙍㚀键塡䦑ҩ窠㦁⏛湤躃㶷㽀獤⎌馀㽵□ⵄᅔ☓苠哢㾷忰᧰䚮趒ڣ仠贴䙋䛇䐈ᅈ㟗懹ԍቦ鳓㙆胨ᯍ䡀偨搼晪杭戙湡亁䷇䆑◁ቾ鶀ᖠ榽铄ݤ◳耭窤㖁╛湣躁緗㽀捤㬬駊㝈㚃镄Ⴄ☋萬暀杪憙胨梈㜷彠此䄮馀♀棽瓍䡡㡈搼暄杭戙湤溁䷇䆑◵ቾ鶀⢠榽铄ᄴ◳耭窤㲁⏛湥溃㶷㽀罤⎌馀ᇠ槽詠婱爛狠⋂ᓶ忰Ⲛ橢⍂ߚᖹ钠䆁Ⱋ茨ᓨ㙷姹߁窠㖪㙗皣畄ᑴ♫萬暾杣憙湦玤ݦ睠䭄䔮䙉䛆萼詡㩐稓琈檐杯懰ᯐ䟮鶒߂ᖩ鍆邂Ⰰ樽詣㩐鈛狠壢⡶怕☧ⵄڔ☓苠⢂㾷忰ᄰ䚮趒ԃ仠䤔䙜䛇萨ᔈ㜗懹ڱቴ鳓孱␈ᄈ㜧彠䭄奎馀ᘠ朽瓄Ⴆ禱ҹቼ鶀ᒠ沽铄ڤ▻耬晾邀㑵□躁跒Ԛᗥ镆䙇䛁菼詡⍂ߋ仠ᘂ㒷㙁㚆啎塠㡈㐙負ᡊ㙌䃈ᑈ㜷彠罤䄮馀⤠棽瓍䡡顨搼暜杭戙湧溁䷇䆑☝ቾ鶀㗠榽铄ሴ◳耭窤䚁╛湨◁緗㽁Ⴄ㬬駊㝐胨ᐨ㜧彠筤奎馀⢠朽瓄ᆖ睡ᇨ暄杮懰ᘐ䥮鶒ݲᖍ鍆䙘孰╺橢㩐騙څዲ鷓㙈皠键塠熱ڹ窠㚁⏛湤◃㶷㽀杤⎌馀ᒵ▥玤န☓苠䓂㾷忰ᕐ䚮趒ԛ仠儴䙈䛇䐈Ⴈ㟗懹ԁቦ鳓㙁䃈ጭ䡁遨搼暚杭戙湧亁䷇䆑☩ቾ鶀㝠榽铄ዤ◳耭窤䦁╛湨躁緗㽁Ⳅ㬬駊㝒㚃镄ጤ☋萬暨杪憙胨欈㜷彡㭄䄮馀㣠棽瓍䡢塨搼暬杭戙湩溁䷇䆑☽ቾ鶀㧠榽铄Ꮄ◳耭窤亡⏛湪◃㶷㽁䝄⎌馀㑠槽詣橱爛狠廢ᓶ忰ᠺ橤洂ߊᖹ钠㾁Ⱋ茨ᒨ㙷姹ډ窠䦪㙌㚃畄ᆄ♫萬暐杣憙湤厤ዦ睡ᛄ䔮䙡䛆萼詤㩐稓琈檲杯懰⡐䟮鶒ᄪᖩ鍆邂㭠樽詥䩐鈛狠竢⡶怕☪鎤ሔ☓苠惢㾷忰␐䚮趒ޓ仠焴䙫䛇萨ᡈ㜗懹ލቴ鳓孱⤈ᖨ㜧彡ᛄ奎馀㛠朽瓄ጦ禱ݡቼ鶀㙠沽铄ቤ▻耬暦邀㯵▧躁跒ယᗥ镆䙟䛁菼詤䳢ᄳ仠拢㒷㙏㚆啎塡顨㐙負䎪㙔胨ᛈ㜷彡䝄䄮馀㩠棽瓍䡢遨搼暺杭戙湫亁䷇䆑♱ቾ鶀䁠榽铄ᓄ◳耭窤审╛湭亁緗㽁筤㬬駊㝛䃈ᚨ㜧彡䍄奎馀㧠朽瓄ᐦ睡簈暬杮懰✰䥮鶒ᄒᖍ鍆䙩孰Ⳛ橤穰騙ݵዲ鷓㙒皠键塢⥑ޕ窠䪁⏛湩◃㶷㽁㝄⎌馀㙵▪ⵄዴ☓苠波㾷忰♰䚮趒ရ仠甴䙢䛇䐈ᗈ㟗懹ݩቦ鳓㙏䃈ᙍ䡂表搼暸杭戙湫◁䷇䆑♥ቾ鶀㻠榽铄ᒔ◳耭窤嶡╛湭躁緗㽁荤㬬駊㝜㚃镄ᔄ☋萬曐杪憙胨消㜷彡譤䄮馀䋠棽瓍䡣硨搼曔杭戙湮溁䷇䆑⚕ቾ鶀䓠榽铄ᕔ◳耭窤撀䍐㑈ᰄᐲᄩݠ暜䙕㙈湣詠硡罠盠㺀ԈႮ☱䩁衠ᄠ◠檼杺懰⦰䣮鶒ᅒᖝ镆郊㙀⠀楤䨲ҡ䙈交懓㙗䊈▎崄Ⲇꖢ乨邂⎰Ҫځ梄妱▥窠⤠㵵▣䩇崂ڑဝ窠ᄀ㵐㔜钄ᔷ䆑ҥዴ鶀ހ殽铄Ҵ◛萭竣㟉锤栺檨በᄠ◀櫢邂ᛐڈ᧮嵲ᅓ琈晴杺懰Ꮠ䣮鶒ڒᖝ镆邡蹛蝋痍䡤㝀ހᖈ䡼孱ᑈԄއ䇉ҥ贴䙋䛍䐈ᅈ㞗懹ԍቮ鷓宀迍ꆙ繆睲⭀ڐበ㝀胨柤ނڛ琤晴駊㙆㚆畄߄♋萬晸杧戙胰懐琜登仩◠技䛸湠䩇浲㡹Ҥ曢韓忰ڐ䨎顠⠈琽負ᄡល茺橡贂㚫仨䌔䙌㙉胨ᅄᒦ睠仠唴䙎㙅湣㒮㡀臻仠䋂䂷㙇㚅啎塠顨䐝贴桑硂娡厤䥢ڪᗹ钠ⵁ❛茨ᇨ㛧懹Ԕ晢䙼怘湱铍䡄ᓑ◉窤㥠ᯐᔜ钄߇䆑ڍዴ鶀❀殽铄ᄔ◛萭竣䫅ꛈ蒺檨በ⚠値晴䙍廱ᑈԄߗ⦻狠㫂䒷㙅㚄镎塠硨倽贴䚂孱ᒚ檢桠靠琭袠㒳孰ᛐ䦎顡䡈簽負㪁ᔻ茺溚舿㔃逈櫤䙌䛏䐈ᆈ㝷懹ԑቴ鷓㙆▢橡綗⚠吭窠槊㝅胨栄ᄒރ琤暆駊㙆皦畄ߔ♋萬智杧戙胰奺职ᕫ仩ᴀ檀ᛐᑜ䩁塠觩⚰晴䙌弙茨ᅈ㠧彠卤䴮馀ᦀ棽铍䳢㚳仨唴䙍㙘䃈Ꮔᑶ睠狠嬴䙗㙆湥㒮㡁䧛仠哢䂷㙋皥啎塡恨䐝贴柡膦譠厤䟢ڲᗹ钠㒁❛茨ለ㛧懹Ԙ晶䙌怘湱㒭䡃㦑◉窤⫠⋐᧼钄ߗ䆑ԑዴ鶀ᰀ殽铄߄◛萭竣擫覰曺檣塠睠吤晴䙎廱ᛈᅄဇ⦻狠㫂䒷㙅㚄镎塠硨倽贴䚀孱ᓚ檢塠蝠萭袠㶳孰ᙐ䦎顡䁈簽負㦁ᔻ茺溘昛ⵀ㯨檎䙍䛏䐈ᇨ㝷懹ԕቴ鷓㙆湢橡趗⚠砭窠棊㝅胨栤߂ݻ琤晸駊㙇㚆畄င♋萬晼杧戙胰擷嗹些仨蒠⠠ᦘ湢詡絲㟁Ԉ智韓忰ᑐ䨎顠聨琽負⥁ល茺橨崂㚓仨伴䙄㙇䃈ڤᄖ睠因贴䙔㙇▤铎㡁䇛仠仢䂷㙊㚅啎塡䡈䐝贴桞顝䟞ⵄ䝲ڒᗹ钠⡁❛茨ᄨ㛧懹Ԉ晶䙍怘湬㒭䡁禱▭窤ក⎰ᛜ钄ဇ䆑ҵዴ鶀ᐠ殽铄ڔ◛萭竣䷭黏䒚檣䡀㽀吤晦䙊廱Ⴈᄤޗ⦻狠⋂䒷㙁皤镎塠䁈倽贴䙛孱ᑚ檡桠你砭袠㪳孰ᒐ䦎顠表簽負⬁ᔻ茺溞璎ꌃ須檈䙋䛏䐈ᅈ㝷懹ԍቴ鷓㙅湠詡䵷⚠㠍窠㶪㝂䃈枤ڒڣ琤晪駊㙅㚆畄ބ♋萬晴杧戙胰庚攺䨳仨咠ᒠዸ湡ᖁ嵲㜙Ҭ晶韓忰Ⴐ䨎顠䡈琽負ᗁល茺橥鴂㚫仨䌔䙇㙅䃈Ⴄ߆睠☠⣔䙎㙅▣㒮㡀觻仠䋂䂷㙇㚅啎塠顨䐝贴柦湜ꛟ玤䜂ڪᗹ钠ⵁ❛茨ᇨ㛧懹Ԕ晨䙋怘湦铍䡁䆑▭窤កᛐᔜ钄އ䆑ҵዴ鶀ᐠ殽铄ڔ◛萭竣洛槟Һ檡塠㽀㠄晦䙍廱ቨݤߗ⦻狠⋂䒷㙁皤镎塠䁈倽贴䙚孱ݺ檠顠你怭袠㒳孰ሐ䦎顠恨簽負␁ᔻ茺溙犛㭀❈橼䙂䛏䐈ڈ㝷懹ҩቴ鷓㙁■詡綗⚠䠍窠㪪㝂䃈杤ڒԛ琤晪駊㙄㚆畄ݤ♋萬晰杧戙胰摛⡎鹳仨䂀ᒠዸ湠橠浲㛙Ҩ晦韓忰Ⴐ䨎顠䡈琽負ᗁល茺橢鴂㚻仨㬔䙈㙄胨ငႦ睠㫀Ⲕ䙊㙃湢㒮㡀懻仠㫂䂷㙅㚅啎塠硨䐝贴栊歉嬡ⵄ䝂ںᗹ钠㖁❛茨ረ㛧懹Ԝ晤䙄怘湤铍䡀覱▭窤កᖐᏜ钄ݧ䆑ҵዴ鶀ᐠ殽铄ڔ◛萭竣茳蟒枺檢㡀㽀㠄晦䙏廱ᆈݤဗ⦻狠⋂䒷㙁皤镎塠䁈倽贴䙋孱ݺ檠顠你倭袠⡳孰ሐ䦎顠恨簽負␁ᔻ茺溛佾尘䏨橴䙂䛏䐈ڈ㝷懹ҩቴ鷓㙁■詡鶗⚠䀍窠㒪㝂䃈朤ڒԛ琤晪駊㙃㚆畄ڤ♋萬晬杧戙胰悴嗼⩋仨䒀ᒠዸ湠橠浲㚙Ҩ晦韓忰Ⴐ䨎顠䡈琽負ᗁល茺橡紂㚋仨㜔䙆㙌胨ငᄆ睠㫀圴䙈㙃□铎㡀懻仠㛂䂷㙄㚅啎塠桨䐝贴桍泃难玤䝢ڊᗹ钠⛡❛茨ᄈ㛧懹Ԅ晤䙄怘湢铍䡁ᓑ▭窤កᒐቼ钄ڧ䆑ҵዴ鶀ᐠ殽铄ڔ◛萭竣漯沠䔚檢በ㽀㠄晦䙉廱ᆈݤݷ⦻狠⋂䒷㙁皤镎塠䁈倽贴䙑孱ݺ檠顠你䠍袠☓孰ሐ䦎顠恨簽負␁ᔻ茺溘ꡞ嘳鐈檂䙂䛏䐈ڈ㝷懹ҩቴ鷓㙁■詡㵷⚠䀍窠⡪㝂䃈朤ڒԛ琤晪駊㙃㚆畄ڤ♋萬晬杧戙胰擒鹫扃仨傠㕠ᆐႼ䩀䡀䧉◜晤䙃弙茨ݨ㠧彠㝄䴮馀ዠ棽铍䳢㚋仨㜔䙆㙎胨ငᅆ睠㫀弴䙈㙃□铎㡀懻仠㛂䂷㙄㚅啎塠桨䐝贴栧瞯冿厤䞢ڊᗹ钠⛡❛茨ᄈ㛧懹Ԅ晤䙄怘湣铍䡁㦑▭窤កᒐቼ钄ڧ䆑ҵዴ鶀ᐠ殽铄ڔ◛萭竣砦竻䃈桄Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㚪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰捚傪▫仨䚀ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈暂邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚡夛爰㦑◤晦䙄廰ݨݮ㡡㝀☠⎂駓㙂㚇畄ڄ☻萬晨杪戙胨ᐭ䡠熱◁窠ᰀ㟵□詣鴂ԉݩ窠◀ᒐሜ钄ڷ䆑ԁዴ鶀ᖠ殽铄ݤ◛萭竣弢鳘ݺ檢硠灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᘜ鎤ᅆ睰㇈橪䙆㙄䌜䩀趖睠㭄孎䙅䛊萼詠穰戛琉ᕹ舑髢䃈梤Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㖪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰壓呩溋仨䒀ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈暀邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚵䌕䃀妱◠暂䙃㙂䊈ڄڇ⚰櫠ᗀᓱ怙湡◃跒Ԃᗍ镆䙄䛅䐜鎭䡠熱◁窠ᰀ㣵□詤㳢ԉݱ窠◀ᒐሜ钄ڷ䆑ԁዴ鶀ᖠ殽铄ݤ◛萭竣懵窹栺檢衠灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᗜ鎤ᄶ睰㇈橪䙆㙄䌜䩀趖睠㭄孎䙅䛊萼詠穰戛琉ᓝ㣋涜䃈梄Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㢪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰圛䋉䈋仨䪀ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈晾邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚨悟龷禱◜暀䙃㙂䊈ڄڇ⚰曠ᗀᓱ怙湡◃跒Ԃᗍ镆䙄䛅䐜鎭䡠熱◁窠ᰀ㧵□詥䳢ԉݹ窠◀ᒐሜ钄ڷ䆑ԁዴ鶀ᖠ殽铄ݤ◛萭竣爬魀䓚檢硠灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᖜ鎤ᅆ睰㇈橪䙆㙄䌜䩀趖睠㭄孎䙅䛊萼詠穰戛琉ᕡ㳮澞䃈桤Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㞪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰嫔慻艃仨䢀ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈暄邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚦恹弧醱◨晾䙃㙂䊈ڄڇ⚰拠ᗀᓱ怙湡◃跒Ԃᗍ镆䙄䛅䐜鎭䡠熱◁窠ᰀ㳵□詥洂ԉށ窠◀ᒐሜ钄ڷ䆑ԁዴ鶀ᖠ殽铄ݤ◛萭竣䫌颺䖚檢衠灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᕜ鎤ᄶ睰㇈橪䙆㙄䌜䩀趖睠㭄孎䙅䛊萼詠穰戛琉ᒋ鈘皟胨桄Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㚪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰摸⢨㹋仨䚀ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈暂邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚥皲挰⥑◤暄䙃㙂䊈ڄڇ⚰滠ᗀᓱ怙湡◃跒Ԃᗍ镆䙄䛅䐜鎭䡠熱◁窠ᰀ䃵□試鴂ԉߑ窠◀ᒐሜ钄ڷ䆑ԁዴ鶀ᖠ殽铄ݤ◛萭竣♸镘暺檢硠灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᘜ鎤ᅆ睰㇈橪䙆㙄䌜䩀趖睠㭄孎䙅䛊萼詠穰戛琉ᔙ锁荡䃈梤Ԓԃ櫠ᴀ✑㝃□ᖁ㵗䇙ҭዼ鶀ᇠ欽铄Ԕ◳萭窠㖪㝁䃈杄ڒڃ琤晰駊㙃皦畄ڴ♋萬普杧戙胰崟䉪乻仨加ጡ㕻湠溂巗㽀⚤㬮馀Ⴐ߈ᄎ嵲ԓ琈暀邂ድ☡橠硠懻櫠⣦邀ᒠ泽詠話创狠⭂┗怕㚬馞⭀䆑◠暂䙃㙂䊈ڄڇ⚰櫠ᗀᓱ怙湡◃跒Ԃᗍ镆䙄䛅䐜鎭䡠熱◁窠価⏛湪亃㶷㽁䭄⎌馀㣵▬厤ᓤ☛苠鋢⺷忰⻐䞎趖睰拠Ⲕ䙇㙜胨ބᓦ睠䛀⬀┓廰ሜ鎤ݤ♳苠㛂㮷忰ተ䜮鶖确决汌ᗪ㝌▢亃跒ڊᗍ镆䙉䛅䐜詡㡀㝀㠍袠㞳孰ᠺ檠崂㙩Ҹ晰駑㙃䌚橠穱稙ҵዪ鷓㙂皡镎崄㒼稯幪邂☰߈ݮ㡀㽀䰄橬䙄㙄芼铄Ԕ⚓苠⋂㦷忰ߐ䞎鶖睠瀈橤邂ᔐᄨႮ嵲ڃ琈普杺懰ሐ䣮鶒Ԛᖝ镆邡ꂏ铐䜍䡡㝀⚤捎䙂䛉萼詠䩐稛狠ᗀᒠᘹ芨ߎ崂ޓ仨♴䡆㙂湡铎㡀击仠⭂䂷㙃㚅啎塠塨䐝贴桎椿佡鎤䞒ҹұ袠ዠዸ滥橠䡀䇋琬晨松懰Ⴐ䢮鶒Ԃᖩ镆邀◕☢厤䛆睡卤䌮䙫䛌萼詥婰䇳狠甴䙸孰⢐䠎顢硨谽負傡ᇻ䌈ᙍ䡃憱ԝቾ鶀╀榽铄န◳耭窤ᓁ╛湠躁緗㽀Ⳅ㬬駊㝈□玤ڲራ仠ᴀᡊ㙄□橠鶗⚠䐍窠◡ⴛ湢◂緗㽀䝄㔮駊䜷項开鴂㜉ԅዼ鶀ᘠ欽铄ݴ◳萬晲䙂㙂䌜䩂趖睠蠈橦邂ᏐᆈႮ嵲ԓ琈晪杺懰ᄰ䣮鶒Ԋᖝ镆邡烘仉畭䡡坠⭀⚂䙃㙄芨朤ڂڋ氭負ᓁ㕻湠躂巗㽀Ⳅ㬮駊㙈胨暭䡠彠㫀㜦鞀ᖹ胨ဈ㟧彠䍄兎馀ᔠ栽铍䩘檄駹霴䡑㙁㚇畄Ԅ☻萬晤杪戙湠橠塠燻櫠Ⲧ邀⛕☡ⵄ䚢ԉҽ赂䙅怕□溃䷒Ԓᗕ镆䙆䛃萼鎨䗯Ꞝ㰥窤㡠⢐߈ݮ㡀㝀㠄檊䙂㙁芼铄ڄ⚓苠☢㦷忰Ⴐ䞎鶖禱◅窤◀䣵⻀槤Ңዱڄ晲松懰ጰ䢮鶒ڊᖩ镆䙉㙁□㒮㡁击仠头䡃㙄芨梄ڂڋ氬晦䙄弙湠躃跒Һᗍ镆䙃䛅䐜鎤ᅆ睰⚤捎䙂䛉萼詠䩐稛狠ᗀᒠᘹ芨ዮ崆睰㛀ᚢ䡑㙁■钎塠㽀㠅負ᗁ㕻湡◂巗㽀㝄㬮駊㙉䃈枍䦠㚡Ҡ曞䙃㙖㚃畄ᑄ♫萬暸杣憙湪ⵄᔖ睠杤䔮䙐䛆萼詢ᖐ稓琈檀䙅孰ቨ߄ڷ䇉ҽ贴䙈䛍䐈Ⴈ㞗懹ԁቮ鷓宀ꆖ应丆睰㇈橪邖Ⴌ■ᖈ㡀灨ꁼ晲杳戙湢亁䷗㽀䫀ᗀᗳ廰ᗜ鎤Ԗ睰㇈鉤◀Ұ㔈ᣄᑔ☓苠胢㾷忰⥐䚮趖睠搈曜杯懰㗐䟮鶒ሲᖩ鍆邀ᔵ□䩀衠槻櫠Ⲧ邀ᐠ泽詠穱创狠⢂┗怕㚽齜闗膱▼晤邂ᄕ⻀棤ҢሡҬ晨鞀ᆐጼ䪁顠䝀䰅赆䙃䛏䐈ڨ㝷懹ҭቴ鷓孰ሚ檠鴃噰㛀ڀ厀㻠槽試㩑爛狠裢ᓶ怕▮玤Ⴄ☛苠䛂⺷忰ᖐ䞎趖睠㿨晤䙅㙄䌜䩁⏖睠⚤孎䙂䛊萼詠䩐戛琉ᕥ頥耞䃈朄ڂᅓ倈鉤㙠ҰڈငԒڋ琤晾駊㙃皧畄ڴ☻萬普杪戙胨ލ䦠㙀喨摤㖿ޟ♠◂⍒㚙㙀ᘀጠ㙀㚽䙩隤ቬቡ黢◡ᖈ㫐䣈㛁Ꮣ佤䛂▰侕䄐啎㩗醱▩በ杰䛄ᖔ満䶆罰ᘀጠጫ⻐ҳ䟠䡀ቨ㟩ተ㚒㛂㚦㢸Ң晰Ⴔ䁂杠㙂䄈䚠䩀㡀➽በ䙄䜀ݲ䟠ᇤ⚙ұᕿꡟᔥ榠ᓄڄ◑ұተ鳇㝀䄝満㵒Ңᖅ輶枞孥满満䶄ⴄ絠ߔ乢ұҡ▤ڂԐ枝躢␁Ұ暠蹠䩂Ҡ柼橤䙄䫆晨ڄچ罰☠⋞Ⳁ㙀◠䩀䡠㺨Ⴄڂᒌᆅ湠◂洂晰ݨᗀកႰҨဈ㠗塨㠅竢㚪㩁Ҩ晨頒ԉҨ岢កᔠ暽ᖠ顠ڨԌ晪ᗀ㙂溠ᆀ䛲Ҩ婨㳂ԁހ暨ߎ来偬袯Ҡ乢Ԙ滠♁皒Ҡ柕盢Ꮄ䜒䮰ҭ䣀㙁□⠚ᒋᇠ■ᖀ㡀ݣ䋈ጠᗏ㙀湡⺤䚒Һ䰄橤䅡ݰᄨڤԁ罨⭀Ԁ璂Ҧ晢詠㪐蹰卦澍晠㩁Ҩ晤ڄꂨݠᴀԀድ稦蠀㡀⚰ݠ◀鞁ᒐҤᓠ䩂Һᗁተ㚒䷢㙈ҤځᑹҸ晦㚐㙁盀ډ隤Ⴀ㻀ᰀ䁌Ⴅ湠躀巂㙊ᖍ軣䋓虠䃈䛠乔Ⰴ畠ڐበ㝁㚀䩀㶂㙋橱ڀឈႤᒀ䞨㾉䑀ݠጠᎲ䅁Ҩށ塰⚠㫀⬬ቨ㙀湡洠䜂ԑҴ鉤⫠ᒐڍ暡߀◹Ҡ晦䙄孨㦂詠Ⴇ㽐Ⳕ䁂⪢ᦀ橨Ҩ㚆硨杤㙠碡搕■✃婰曢滤▤晢䙁㙀癀䩀㡂ᴒ䷠ԈႠ☠䩀橰䇱□銤ጡᇸ瞡▤ڄⴄ腠ڐበ䳆栨ځ癴Ⲅ畠ڐበ㝀㞃䜤ҡᑫ䝄ᚨ栄煀Һ歠䙂㙈柼晨醁ᆐڄ➄䙀䡀Ⳁ晠㚧㙂䄈暤Ԓұҭ㢄ቻ㛁湠ᖀ㡀㜙ᖄ晠㚎㝀ᓀᅁ塠⚰ݠ◀鞁ᏐҤᓤԔ☢ᖠ䛤潭ᏐҨݢᨲԉҬ䛠栄燀Ҫڀዠ⠨婰晢杣慱ڐ䚮橹諾ҡ窢␁粫噠ᛀ䙂◒ᴒ䷠ԈႠ☠満㡀⨡▥裪Ⳃ㙃灠条暐繲ݠᘂ꜓䛀芨ҭ䡠䁈㐐橠栄灀Һ歠䙂㙪ᖡ窰በ㝁■◓澜ң仨ݮᗀ㙁■⍠䜂ҡҨ鉤▬ݥ盅㢸ҢҪᨸ晦鷑䅁Ң詠硠䁈㐐䛚䙅◙溠蟠霐㡂ᖄ晠板廱ҽቪ硠㝀ሑ袀菈㝁㚀铤䙄ⴄ畠ߔ乢ұߐ䝍䣀㙁▤晠柼灀Һ檠ᗰ䡁Ҥ晠屢ᯐҨԆ蚀曀ᖭᒩ㨀Ԁ讄鹠Ꮐ㙂ᨸ晤鷑䅁Ң詠塠䛂ꌠᴀᖐ廱ᄨڈ㙷䝀㟬橤㚐䜒䯰ҥԀႰұڀځᇻ☠◀嶤Ⲥ畠ߔ䝇䜖䯰ҥԀႨ㹉ꖃ㫓虠⠀晤䙔▩ҡ躤ڱዠ□譠䛀虨卦侇晠㙀■咦蚀Ⴀ䉬桠䙇㙃⻀杤Ңԑ繨㺀ᰀᔛݣᖀ衠ᇰ◀㳃勶虠□䴀䙄ⴄ腠ڀዶႠ■衮塰㺠㹭ᒩ㨀Ұڈڎ䦠㙁Ҽ㲂ᄀᔐᆍ暡በ⚠㼘ᖘ䙆㙃珠柤ڢҩ繨㙖栌燀Ҩކ蚀ቭ㢛Ҡ䙃䅁ңԁ塠Ⴀ⭀♴㚍ᣐҤ㒤䙰蹨剩Ҥ晢䙁㙀湠䩀㡀⚡ᓉ㴀Ҵݠᗀበ䢈㝁ᓑ㴀Ҵݠᗀበ䢘婨晶杨䛄ᖔ橠洄♂ᖠ䛤邡◀桤⡍䩘ᖀ㚁䩠暀ᣔݠᗁߐ⠈ݤᯘ⚫䜖䯰ҥԀႨ☠ڀᗫ㝀皤◁Ⴅ㢈㝁ᓙ㴀Ԁ晭暠ᖚ䫶Ҡ癤ԁԀ辅繠ᖐᇰ■晤䙀◆湠桮塰㺠䩬晤䙄◘溠◔濌ҡҤ鉤ځ粫噠ᖀᓠ㙁Ҡ晢㚐㙁□ቫ顠㛃狤ᯘ▫㙅灠杤㜄㇄腠ڀ⤨Ⴂ☢準濌ҡ䙈ߔ䡁䅁Ұ嵲鉠ቭ袻Ҡ乢ұҨԄҢҪ勌鉤Ң䙁㙐屲鉠ᄠ■☠栜燀Ҩ䙀婢Ҡ柠晰汭ႰҪځዠڨԌ㹄⥁身噠ᛀ䙂㙂㫀㚀ډ彦朣ခ塠ݣ䩴ڀҰ孰ᒑ蠀በႰᘠᖀ䡅䜘䯰ҥԀႰ⛔⚞䙅㙀灠曭䡀㢘㭄Ҷⳃᦀ骅繠ᖝᘶҠ癤ԂҰቨႤҤ缹繨ڀ◀ផ◠亗濌ҡᖀᘀጠᇠ■䩀Ꮐ㙂䉑ڀԈႤ☠ᇠ㜀㚘勠Ԁ轭ҰҤⵄ߄囈ᖭᓡ㴀Ҵݠᖡ㩛謖Ҡ桠ጠᇠ■ᛀ䙂ڊ婱ڀҰ噰ጲ蠀䛲ҡ䙈㚄ҭҥ皠ᖠޒډҠ䜀䡆䛊㚂ቪ䡠ꇺᦅ窤Ⴐ忱Ұ䝂គң勠ᑔ䡀㙀㚄◁Ⴅ㝀䯩㡶䡍◙溣橡硠黣櫤ݢ◡ᖈ㫈䚨㞄◠枨桪杰䛄ᖔ檀䩛ᘶҠ晰䙈◙滠亁Ⴅ㝀ᦌ橢㚱㝃珠晨䃉屠ݠ㫂☊㙁■詠紆睠ᦉ粤ᒶႠ□詠婰⦱繨☢◡ᖈ㫈䛨㞄◠枨桤杰䛄ᖔ檀㡀彠⬁袠ᄀႰᄰ䝍崆砐▱ᔙ㴀Ԁ蚀㙀㦠㙁Ԕ晾㚟䜞䯰ҥ㙠Ⴈ曠䋂☊䜢䯰ҥ㙠ᇸ■晼䙐䇁Ұ彲鉠Ⴀ圸ᖀ栠燀Ҩᄦ蚀ቭ颻Ҡ䙈䅁Ұ廲鉠Ⴀ弸ᖀᓀ㙀㚁ቮ㡐⚠Ⴄ㒬ቤ㙃■䪀ᖐ䦒劔Ҷ䙉㙆矣䜤ݲکԅ粤ԀᘐҤ㑢ᙂҢᯀᘞᗀ㙄湠ባ䜀暹ҡቦ鲂Ԁ朽◓澜ң令ᖄꛁ炩陠ᛀ䙂㙊ᖄ晠骂Ԙ杰ᖀ䣀㚀噤㳃㫓虠■ᖀ㵣噰ݠᖖ䝀㙁▢䴀䛂ҡԄ鉤⫠ᘐݭ暡桠潠ߘᖐ⪧ᣐҪڀተ㽀ݠ㚬በ㙀■ᛀ䚂ړ伸ᖈ䙈◙满亁Ⴅ㝈☠ᰀ馂ހ桤⡄㙂ځҨ晪释㝃□ቮ㡐彠㻀◀薀ᆐҨԍ崂㙁Ұ晬郋㛂■◖✌ҡ䙈ݮᗀ䜖䯰ҥԀႠႸ䁈䙀㩁Ⴐ䚮㩐⠸婴ᘀ䙀◓满亐Ԅ麂ݠԀ䅌ݥ湠◁洂晰ݨᗀځᖵ⠀晤䙔庂ݠጠዶႦ■橠㦠㚀噤㳃㫓虠㚥㢸Ң晰Ⴅꋠᠡᇻ䐜䴀䙀罠㛀⣔䝄㙀□䡎㡐ڠ㩭ᓡ㴀Ұል暠ᖚ欖ҡᓑ㴀Ҵݠᖀ洂㙁繨ڀ⏀Ԁ暼洠䚂Ԑ栬桦⪧ᦀ邅繠በႠ㟬橢屢Ԁ銅繠ᖛᘶҠ癤ԂႰႤ㑤䙃噰ݠڀᄡޙ⻀曤ԂԀ柜晤㚳㛁楡柈䍉屠ݠ㚬በᯁ椨ҤҢ晰㛀㬔屢ዠ銅繠Ꮐ㙂⍂叠ԈႠ▢玢ᒀ虸卦羍晠㙃珠晨䂉屠Ⴆ澍晠㩁Ҩݭ䡠ᇰ■普䙀◈□桮塰㺠⫬普䙄㙀ᖓᖀ橸Ҳ扱ڀ⏀ቨ⋈߂⏒▸噬㲀ᗁᇻ☠◀嶤Ⲥ畠ߔ䝂ᄟ盅㢸Ң晰ݨᏂᄀԚ☠㑠橢ұ䙈㙘Ⴋ䜊䬰ҤҢҫ漸ᖀ䙂ᣐ晨ڄڳ噰䛀ڀ⏖Ⴆ□詠䦠㚡Ҽ晠屢ᖐᆄ㒤㙰虰卧侍晠䜿渭暠ᖜ欖Ҡ晸屢Ԁ隅繠በ砐□ᓹ㴀Ұቭ暠ᖚ櫾ҡᒹ㨀һݠ◖⛜Ң⋒䷠ԖႠ㚩㢸ҤⲤ畠ڬበ䜜䬰Ҩ䄉䑀ߘᖀ栌灀Ұ嫲扠ᇰ□ᔁ㨀Ԁ鎄鹠ᓠ㙂⍲䷠ځ粩陠⍠䙄㒄畠ݣ拳虠⻀晨䈉䑀Ⴆ辇晠䅁Ұ恲扠ቮ㢏Ҡ屢Ԁ鞄鹠ᖛ諾Ҡ鉤ځ銩陠◙澜ҡ繨ݣ狳虠㚱㢸ң噰Ⴇ枇晠䜪䬰Ҧ蚀ቮ碯Ҡ栬灀ҭ暠ᖞ櫾ҡᔹ㨀һݠ◛澜Ң␒䷠ԖႠ㚹㢸Ҥ㔤畠ڬበ䜸䬰Ҩ䒉䑀ߘᖀ桌灀Ұ拲扠ᇰ□ᕱ㨀Ԁꇄ鹠ᓠ㙂╲䷠ځ鲩陠⍠䙄⪤祠ݣ髳虠⻀晨䘉䑀Ⴇ辇晠䅁Ұ坲牠ቯ颯Ҡ屢Ԁ螅㹀ᖟ諾Ҡ鉤ځ溪噠◐澬ҡ繨ݣ⭔虠㚡㣘ң噰Ⴆ垉晠䜆䭰Ҧ蚀ቬ碳Ҡ柬烀ҭ暠ᖚᘦҡᒩ㬀һݠ◓澬Ңᴒ俠ԖႠ㚪㣘ҤⲤ祠ڬበ䜘䭰Ҩ䂉䱀ߘᖀ栄烀Ұ姲牠ᇰ□ᓱ㬀Ԁ醅㹀ᓠ㙂⍒俠ځ碪噠⍠䙄㑄祠ݣ嫴虠⻀晨䆉䱀Ⴆ羉晠䅁Ұ彲牠ቭ颳Ҡ屢Ԁ閅㹀ᖛ䫦Ҡ鉤ځ躪噠◘澬ҡ繨ݣ櫴虠㚯㣘ң噰Ⴇ垉晠䜦䭰Ҧ蚀ቮ墳Ҡ栤烀ҭ暠ᖞᘦҡᔩ㬀һݠ◚澬Ң⏒俠ԖႠ㚺㣘Ҥ㔤祠ڬበ䜮䭰Ҩ䎉䱀ߘᖀ桐烀Ұ拲牠ᇰ□ᕉ㬀Ԁ鶅㹀ᓠ㙂▂俠ځ鲪噠⍠䙄㖤祠ݣ諴虠⻀晨㹉呠Ⴇ辉晠䅁Ұ擲牠ቯ墳Ҡ屢Ԁ袅幠ᖟ謆Ҡ鉤ځꕊ噠◞澬ҡ繨ݣ㛕虠㚡㣸ң噰Ⴆ⛋晠䜾䭰Ҧ蚀ቬ袷Ҡ柬煀ҭ暠ᖘ謎ҡᒉ㰀һݠ◔⛼Ңᴒ几ԖႠ㚥㣸Ҥ⬤絠ڬበ䜎䮰Ҩ㾉呠ߘᖀ杨䛄ᖔ檀穱䡈䚁䪂ጡ◀桤⡄㙔⻄腠ڀ◀ᖈ䌈晨㛁Ꮡҡ粤Ұ廱ߍ暠ᖚ欖Ҡ晴杨孰ڈڄږ禱ҡ笶䡅䅁Ҩڤڔ▫漸ᖈ杨䛄ᖔ檀䩑䡈䚁䪂ᄡ◀桤⡄㙂ҹҴ䜢䙀㙀湠溁⍖禱繨☣狶虠㚠㙐ҳ噰ԍበ䝃䜔䯰ҥԀႰݠ☺Ⳁ䜔䯰ҤҢԃ勨Ꭼበ䜘䯰Ҩ䅉屠ހᖀ䡂㙂ᖜ䪀ᓠ㙁Ҡ晢条彻ݡᖀ䡀䛂ꌠᖠ馁ᆅ湢躂⍂䙁Ҭ㸦㡂㭿朿櫀ᖟԓ勨⬈Ԁᒠ虡玢ᑂԒ⋀⍴䡌▶□準Ԇ睠㽆Ҭ邡鹠ᖜᓄڤ㒀㟩ᡍ錸网頃姆觐㹁ҹᔀᗪ䞛憖㱼拈錹缼ᯀ䙆䜜Ⴚ溶锭毯㕚䅶岗ᆀ□準چ硵舓埃訦洭班蛀በ塭䙑童嵌銸齑砓姃幸ݠ⭃䙄宁君䅖䑼嫌錸鑦Ԁᒠ象ⵈ凎败淯ⳛ䅶䇁晨߈凎败淯ⳛ䅶䇁詡ᖀ詸暋佫忑顂褥豋臠ᓰ㹁ҹᒀᡊ䞮咜抸缙揖陠鑦Ԁᒠꔁⵈ含淯⤖㵯唼һ朠ᖀ詿ԃ佫忑顂褥豋臠ᓰ㹁ҹᕐᗪ䞮咜抸缙揖陠鑦Ԁᒠ鹡ⵈ含淯⤖㵯唼һ朠ᖀ詽暃佫忑顂褥豋臠ᓰ㹁ҹᦙ彑韂襅鰻晣幾晰晬柰ድ◢暨በ⠎ᖁ䑈暀ᒠ詡厢ᑂԒᴀ⣔䙀㙀橧詠詸ԓ仠⭃㙅宀ꊠቮᇢԑҹᒀ⇪▨皠ᖠ㙴Ⴀ㽇䙈邀ޕ☠ᖀ㡀妱▼聠Ԃᖐҫ䙀⏓癠ݠ⭃噢孰ښ檡穾ҫ仨㲀◀ᣖ晠㒧䙀Ⴀ孧桢邂ᖐሐ䙭䤐ҡ▼晰占ԙ瓠ҤҤ▫仨ڀ⏀Ҷ晠㒧䙀Ⴀᛄᙔ䡁䛐㠃䙁圠◹ҥ⠚Ԁހ暼䚈በ⠈ᛘ☠杠㛀楠䞤Ҵ⪓櫤䃂ԁݡ癨߈䍀䦑ҥ窤⏀Ұښ檡夰ҡ◘普占ԙ瓠Ҥڤ⻀❈晢邂╀鹠厤䝂ڱڀ聠ڳ䍀Ҩረ䑐⥑◘晶条孶晠ᗁ塠韈ҡ賔Ҡ㙃皠厤䚲ڙҼ聠ڳ䍀ҨᇤҴ△仨ᏎⳀᣐҨԍ䡐ښ㩴ڀᄀផ☡詠ᑐҡ■普占ԙ瓠Ҥڤ㓀㟨晢邂ݰҨԅ癠ᔙ蹠Ҷ䙆䜘ݺ橡䩜Ҡ曜晸䙆䜨Ⴚ溘ҡမҹᔠᅊ㝊湡溘暆瞨■鑦Ԁᒠ鱠厤䞢Ԓ⏐ᙔ佢һ朠ᖀ詾ҫ仨咠ᴁ遡䃊䚀ᓰ㹁ҹᕐᅊ㝌□溛暆瞨■鑦Ԁᒠꊠ厤䟒Ԓ┰ᙔ佢һ朠ᖀ詿晫仨媠ᴁ鱡䃊䚀ᓰ㹁ҹᒀᎪ㝍湡溞暆瞨■鑦Ԁᒐᆐ巠䳢㙹䩈ڮᕈݰᆊڗԂ⚁Ҹ硧噢㛘□溘Ҷ睰髠⭃㩃孴曠⎀噢Ԓ⎀ᑔ䡞㙃㚣ڭ䣐㙁艬ڀᴁ繠胨橄ڤ⫠㇈硤ԗᆀ□溞Ҧ睱ݠ⭃婣孴曠⎀噢Ԓ▀ߔ䡡㙃㚯ڭ䣐㙁艬ڀᴁ晠胨檤ڤ㑠㇈硤ԗᆀ□溑Ҷ睱⭀⭃牣孴曠⎀噢Ԓᴀᑔ䡤㙃㚵ڭ䣐㙁艬ڀᴁ牠胨欄ڤ㔠㇈硤ԗᆀ□溔Ҷ睱㻀⭃詣孴曠⎀噢ԑҸ硥ꊢ䇁遠䩀衠塭噭窤⠩Ⴀ㐀鍤ڤⵀ㇈癤ԁ㧐ᆊ䚴Ԓ✩ҹᕀڪ㝔□源暦瞨■鑦Ԁᒠ鱠ⵄ䣒Ԓ▐⍴佢һ朠ᖀ詽ң仨窠ᴁꂡ胪䚀ᓰ㹁Ҹ晬桌ᇵ☣䭠䙃幺䛀⬀ᴁ汢䃐廠ႧႨݠ⠈暀Ԁ赡厤㚢Ң┐⣔䝏㙀㚁ⵄ㜂Ңᴀ♴䝈㙀㚿ڍ䡑ቨݤ㱆暀ተᄰ䩄ڔ⚢䪬橼㚯㛉湡躇⍂ߙ䩌ڮበ㙃皬ⵄᇢ湸ߜᖀ䙇䛔䃈ᒥ㙰ᇸ■普枀孰ᯊ䚠ᓰ㙁ҽደ邀⦴朠⎀䙂Ԛᗁ窠㱩ᆀ㐀晤ڴ◣仠傲ᒀ䇁ҨငҢ湾䙄鑤Ԁ▰Ҫ䚵ҳ幰ݠ䛂☊㙏炠虦隀Ⴀ杤䜔䙞㫁晭蚠ቡቨ蠈暚佣һ曠ᖁበ螨■鑤Ԁᖠ桺橡橰榱䩈ڮበ㙄㚄ⵄ߄☣伄ᖀ嵢Ұተ䥍䡀表蠈硤ԗႠ▢◄⍂ڢᘁ窲በ䇁ҨႨ㣆睠坤眴佢һ曠ᖁᖓᓑԑᎠ邉Ⴀ㐀晤ݤ➃仠㻂廊㫁ҭ蚠በ睠ބ⍰嵢ҰᏐ䝍䡠⚡ބᯀ嵢ҰᏐ䡍䡠䝁ᘤᯀ嵢ҰᏐ䥍䡠潡♄ᯀ嵢ҰᏐ䩍䡡⚡Ⰴᯀ嵢ҰᏐ䭍䡡䝁㛤ᯀ嵢ҰᏐ䱍䡡㝁㫤ᯀ嵢ҰᏐ䵍䡢罡㻤ᯀ嵢ҰҨᔆ蚋晱ԕደ邂㱐⠊䚠ᓰ㙁ԕዠ邂㳐⡊䚠ᓰ㙁ԕተ邂㵐⢊䚠ᓰ㙁Ԕ晠佣䩛曠ᖀቢ怐⢠ᴀԀ㻛杈ڤҢᆁ艮虤䙀䜘ݺ橠䡀㻀ꌠڀ⥁ޕ☢躃␂ښᖡ軣ݠꔃ芼橡婰樒ᯃꊦ鞀ᦀ汽璮䦠㪠☠ݣ噢孰Ұ埠䳤◀曜晠乢穡溫詠Ꮠ䍀⭄誠ᴁ䉵▪讀䙃幰ݠ⭂囊㙉⡀晦隀Ⴀ㽄眴䙔㫁ҭ蚠በ塩ᇨ暂佢һ曠ᖀ話榱Ԅ硤ԗႠ□溂⍂ԁ䩈ڮበ㙃㚂ⵄҲ湰ߜᖀ䙆㙅⡀晦隀Ⴀ拠䂒በ䇁Ҩረ㛆睡弄ᖀ嵢Ұᕐ䡍䡂辨■鑤Ԁ╀決橥棰㙁艨ڀԀ㽛杄ބҢᅙ繪噪䙀䜀ᆚ橠ᖛҳ佧虠㚰ⳐҰ恠洂ҢᯀⲔ㙑㙀㚤ލ䡀ቮ晱竢䙐㗐Ұ噠贂Ңᴀ⣔桐Ҩ䉆橡詰䇉ᖐ晠柰ᄕ■◐ڦ盠此ڂᄀ⏀蘺満子䡁ԙᎸ鞁⠁癨Ԅᄖ睰䫀㢚Ҡ㙀㚤ڍ䡀⥑◤聠ڳ䍀Ҩᄈ㙖睰滠䪚Ҡ㙈皠厥癠ᔙ蹠ڀ⛡ᄕ☤橢䤐ҡڅቤ邍Ҡ䌎晠በ灨㇈橲䙉㳀Ҩየ㙶矈ҡ賔Ҡ㙊■亀洂㙊䉴Ҷ⤠Ꮠᔚ誀硠䙢ݠጠ㦪㛄湠◒Ԇ睠ᦈ桢ᓀ㙄湢䯠Ңҩ婠ဆ恠Ұጰ䙭䡐潠ᛄᑔ䝁㙂㚟鎤䚀蹠劌晼䙓孰杨ށ癠纹ҡᕠ⇪㡀ᑧ䞀㡇齸ႦҢ醂ቲҨԈ㩆睨㩉Ҥ暀ހ瘲蛨በ䡉蠈檖䙀㙂胨月㧆瞨Ҡ鑦Ԁዠ牺檣桠偩栈硠ԗᆀ□◅⍂㜩ҵጰ邉Ҡ㐀虤ڄ⚣仨抠ᠡ㙵⡀Ҧ隐Ⴀ㝄圴䡟㙂皦ⵅ㙀ᇸ⪠晨杰孱▨ވ㝆瞨Ҡ鑦Ԁዠ桺檤㡀偨䟨硠ԗᆀ□ᖀ磰ҡ艬ڀᗁꊠ䃐晦隐Ⴀ㝇虠邢һ朠ᖀ橾晣佨ڮᒀ㙂㚸ҭ䩠ᇸ⪠晨核ԕ㛀⎀噢Ԃ␀ߔ桠䇁晨ݨ䋀ᓒ■鑦Ԁዡҭ蛈በ⠈᧸梤ᓀ㙀盐ҤҴ㑀ᄄ岤㦁ޘ皠ᖠ硡䁈ᛜ☠䙓䜿Ҽ䩠隔Ⴀ㝅ߖ䙅孱ቨҤږ睰伔Ҡ䙄㙂胨枅癠ᔙ蹠ڀ◡ޕ▢満㳢蹠ݠ㣂ᅊ㳀Ҽ趠Ңԙҵቤ邂ᐣ榠ᅁ嚤Ⴀ㝅ߖ䙅孰Ҩލ䤐ҡҰ晪邍Ҡ䌎晠ޒҡڍ窢ځተ汨ݥԇ蝨㫀◰Ꮈ㛊湡ᛀ䶂♁Ұ癤隁ᒐႪڍ桰彠㛠ᙐ䝈㙂⠀狤㞢ԁ䙉暢㝠ቴݷᖡ桠䞀✀桴䙄㩁㭈䝤ڂ晲曤䂀ᖨᄆ◣橠棠㢁ᖼ晨乢䡐橨ݥԄႨ剭ڀ⛀◕㚁镄ᅇ㽐苠㤔杩懰ᛜ誣㡀坠吉ቮ鶀⍙滣䩁崄◫苠䤦䡚㙆胰䟮顠姹☬晪䙇宀栽詡趒㚱ҵ竢✗㙆䌈柤ဆ硨尼普馂☰ᒚ溂䷒ԋ狨⡀◀ផ㚁镄ᄷ㽐䏩ቮ鷓㝃□厨㛗懹◰晬邡⍛湡铄䞒ރ佤䬮䙅忰枨ငڲڃ佤㤮䙏忱ᕚ溁緒ړ狨㪀㖪䛉䐈Ⴎ墀杠萉ቮ鶀♙满詡⍄◫苠孆䡑㙃胰䟮顡懹◸暂邡⛛湢㒤㛂߉ڜ暒邡⍛湤㒤䝆硨瀼晲馂ᘐᓚ満鷒ړ狨㪀✊䛄萨ᆎ墀蝠倉ቺ鶀⍙滣䩁洄☳苠㤦䝉㙇▦橤崄☳苠㴦䡋宀栽詢⏒㛁ԍ竢✗㙇茨桄Ⴆ硨尼晼馂⎰ᕚ溂䷒ڛ狤㲀㺁昕☦ᇠޒԁҰ癤暀ᦕ⻀晤ڂԁ䙉◠㚪䅁Ⴈݤڂ晲䛀䔔屢ᖐႨݥԄ蝠怈鉤⫠ተႪڊበ醱繨䚀ᖠቴݵᖁ㳣噰盠◠ᖨᄌ▢玦蚁杠㛀◰ጼ㙆䃍暣桠䝀㛠ᙀ䙑孻ݨᖀ桠䞀✰暌邖Ⴒ□ᖀ棠㦁ԁ竌የ㙂□ᛀ䴂ԛ伸ᗘ䙄㙂⠀瑤ڦ砐♠晨䙄㩁䍈Ꮝ䦠㟡Ұ晨乢扰ᠺ洠䧂ԁҰ癤ꋀᐵ⻀淨㙂ݲᖅ褶䙢廰ᘐ䛮橴ᔋ仨⢂曋㛃□亗鹔终☠⬀ᓋ⋁湤満㳢☱Ҩ晪邂ᏐႪ䚠ᓰҡҵᎰ邀⻔朠⎀ҢԊᙁ窠䉩ᆀ㐀Ҥڔ⛣仠悲ᒀ䇀Ҩވ㡆睠鼄ᯀ嵠Ұᄰ䥍䡁龨⪠鑠Ԁᐠ橺橤Ꮠ㹁艠ڀᠡᖵ▨䭠噣幠ݠጠ㦫㝀榠ᅄڄ⪠ᦈ湠㕋㙂湠䡍晠罠㫀⫠鑠ᣐᆈڢ⍰ڞ皈ᖆꙂ敱晰摠⍒㚡㙀ᘀጠᄀݰڈԄҲҩҤ晢䙁㙀湨㛴▨柀橺ᗀ㙆皡鎨㾸ᯀހҠ屠Ұᓐ塰⪠ᄨҠ鑠Ң䙁㙀湠䩀㡀⚠ᘀ䙉䛂䍐䨤ݦ憹◙ᕾᅑ䯂㙈ᄈ眰⠖ᕿꡟꙃ㙄醰材蹢ڕ宰䁊䙋䛀㡃䚄ސ蹺ᖄ桰⪤ᦀ械䙢ᣂ㙊㩴㚀ᄡ琠噠កң幠ݠᏂ☊䜑蚐ҥ癠ሐҠ晸䙁䅁㹈ᆈ仸ᖄጠᎮᎤᯉᑐ幰⪠ቨ警㝃晠▿Ң表噠罠卤ዠ纂ᖢ榡橡በ绣拈㲀⬁㩵▣橡㡀盡䛀㺐የ⋁▣◂⍂ڢᙑ窰በ䅁Ҩᆄ߂湱圼ᯐ䙇䛀花䟠㜀躺ᖥቢ㚘㝀瞣䛤Ҵ㔌ᒀڒҠ䇀ҨԈ㛆硯ᯃҠ占ҽҠᖁ桠❐✠晸棩暠䙤Ԇ隆䚠媌晸柢曂ҭ暬በ衰♼⇠䙌㙃珠毤߂ԑ繨皠⫠ᰀ鹠ⵆ蚃杠坥ߖ䙌䛔䃄ሄ߂晳Ⴆᛁ橠䧂㙈ᆅԄ䡨媐晸乢䙈ᆃᆁ塠螠⚰桼䙌㩁㙈䞄Һ轠⢵ᗁ⋄㝇湠鰄ڊ遱ቺ◤㚚⋄▣ᛀ䫂▱ҵቦ鲂ݰᑒ䟠隔Ⴀ因䓄仦䞀䙠㙐▬▘ቬ晾梘榢▣躣☄㩄ቢႡ蚟柰ᕐ杰誈ᖄባ蚟ᔄ桰ᕐ東ᖨᖄᕠ䕆䙏䝌䡐癰㘀扼㛀䓄仨䞀无雄န㠄䡒⚨嵣㙐ᒐ䩍䩐杠仠ᗀ⬁ᖵ▢ᖁ坡䚨仠䓄ᅜ㛇皠ᖡ㙴Ⴀᘀ㣌ⳇ㙄湢輡盢ځԅ窠⛡ޕ◢䯠Ҥ仈Ԍ晾䙐佦晢蟡ސ蚰卤㳂Ⴐ寠ᑐ䝨㙑ᓘԌ晶条◕晢躁㩐☣剠㲀ᄀᦀ钀幠Ⴃ䙀勠㲀⥁窠陠ቦ晠聨ݠ⣖杧廰木Ԅݦ睨㙍ڀ⫠┻朦ᖁ桠ꂱ䡙ᛁݠ暠䙰䘠◒ں⚂Ⳉ䙏䝌䟐癰▨ᖇသᴀ㖂ᗃ㛠㙐▯လ㑒◠㖂ᗄ㛠㙐㗀ꊹԝᖱ◢暠敡雐桠ꂱ䡡ᛁꔃ柰ᕐ浱◨䩡艬暠⬁㙵㚂ᖁ䡀㝀坤㜔䙈㙅橥ᇠ䡀ꂰᨰ桾杠㛄曰ڨበ⚠䭜☠䙈㙄胨ᄈ㙖睨䫴Ҡ歭ݦݢ蟄ڂ蹠ݠ⎌歭ብ湣詢ក蹠劍ቢ条◌☠䛈በ⠉杈Ҡ䙌㙀珠牤߄㩌ቢԀ嵢塰ᔁ▤ށԐ勠㱈暀ᖈᆂ詡睠囀㩭ቢ条◕晢躜乬Ңᗘ晸枈宀蚀㹀ᖙ橮Ҡ䚞ҫ㙆▢贠䳂ڡԌ鉤誀ᯐቭ暬በ衮晡窠⬁陠䃄⍤߄㒠ᇩቢ屢Ұᒐ䷭䩐㟰■晸杢䅁㝈ᆈ䙣幱因㻃狡虠⻀此߂ڢ␀ߔ屢䩐ᒈᆈ㟆砐⚠晸䙌䛠䄍暧በ衯ҡ窠⬁㩵ᖃ詡棠㣠㝀晸乢乨ᆂ詡誰蹩Ԉ䙌⪡ᣐᒐ矐▨ᣀᙜᙈ䙌㙆珠牤ޔ仈ᘀ㙠ᯌݥ湣䡀蜒Ԙ㝀晬㙆ᣐᒊڌተ▲ҩڀ⫨ᄒ☠詡棠㦁▩䁈暀ݰ档ԁ塠㡨㝁ቢ䝈㙀橡柠㛲ҩҭቢ䙂◉滢♁癰罠ݠᗬቤ㙀▢⍠䙂ڢ╠ߔ䩀┥湠満㝆繠噜㑂☟ᄀݰᖀᖐ䆒ᨱ袤ዠԕ滠詠㫲Һᖑ㴤Ⳁ㙀湠鏄䚤◂䩴ڀᴁᇸ溡躀ተ▲ݠ⋊Ⳁ㙁皠钄㛀㡁Ҩ晠柟怕㚀辀橢ҡᖈ㹂⤠ᇠ蕼䩠桠Ⴈ▭ڀᄀႶҠ◗鹔禱ҩቢ邌Ҡ㚯陉䳢Ҳᖉ窸Ҡ䜟蘲玤Ԅ▻伐Ҡ栟昅䃈䙤Ԅ◃令ᗀᗁ撕☡ᇠސ罠䝔䁀ᓀ㙀湠毠Ҥ㐻ꏉ窢ᄀᄀ暺檀䡀桫ꑈ橰Ⳁᣅ湠ᖀ崂■⚠普歭ҰҨ߈㸇⥑▨繠ځ蘟磨䛤ڴ▪㹴ڀកႶҠ亗鹔禱ᖔ普杢䥆晨ބԂ虠⚦ꗾ烊㛂椨߈㙧坨⭀ጠᡊ㛂ߐᖀተ⚠Ⳕ䁄䙃䜠ڈڨ䉀⡈鋨⢂ᓱ㛃□亀䶂◘⚠晪桜ޘ滢◀䶂㙂㩑ݢԁႦڂ詠በ⥑ᖥበ䝂㙀溠ڨበ㝀ހᖀ䡂䛿茰䜮衠㡈䀙諣ᆂ桤䊚橠ᖐ䦑䙈ڄጡ昙皡锤Ԅ◓耩ᒃᏄᖸ胨Ҩ㛆瞠■橤柟怀栽橠䩐娓潦ᒅᖈ引■◁洂晰ݨᘂ꜓䛃菨ڈ㚧姲ᯆᛈ☑孰曨Ҩ㝆睰ݠ㣎Ⳁᣅ湠䩀鴂□Ҭ晪醁ᆐݰ䝎詿ꊯ陽袠ጡꞀꙁ钍䩘⪠㟱ዠ鲀ድ◡ᖀ誰蹠勠ጠ◡ᄚ䃈䙄ڤ㘿ꡟꔆ邂ᇠꡟꡟ隗⚰ᛄᑔ䡂䛁芠湤Ҵ►䩑ݢԁႦڂ詠䩟蹟ꡜ㔢䝁䛀◠曈በ㝀ހᖀ䡂䛿茰䜮衠㡈䀙諣ᆂ桤䊚橠ᖐ䦑䙈ڄጡ昙皡锤Ԅ◓耩ᒃᏄᖸ胨Ҩ㛆瞠■橤柟怀栽橠䩐娓潦ᒅᖈ引■◁洂晰ݨᘂ꜓䛃菨ڈ㚧姲ᯆᛈ☑孰曨Ҩ㝆睨ݠᏂꌊ㝀榠ᅁ嚤ႠⳆᒁݠ撕◠䚨በ㝀ހᖀ䡂䛿茰䜮衠㡈䀙諣ᆂ桤䊚檀䡀ቨ㟨桠䙁䛿胨暁癠纹ҩተ鲡Ꞁꙁ钄Ԅ㘼▐㔢邡朠Ⴛ◂│ԃ亜㲀ᄥዠ㚀ሡ塠⠈㐄桤ጠ㙀皿鎨㙴溂Ԑቶ䙁䛾䊈䙠婢ԁҠ繠ځ蘟磺橠ᖐ⥑噠ݣ旟䭵■◀䳢虠Ⴆꗾ烊㙀㚀鎥晠ቭ꒽㬔䝄㙀㚁ⵄ㙂Ҫᨱ窤Ⴍҥ椨ڈ眰Һݠ◠ԌҠ㚯陉䳢◁ҡቢ邁Ұݰ噍䡠㚨Ԍ㲀ᖋ齣ځ噄ҡᔡ■晠㚧㝁ᖜ䩠㙤ҲҩڀҰ婦晨ҥԀႨ⪩ڀҰ喂杰ᖀ䡀䆑ᖈ晠䙃◙☠◕濌ҡ䙈ݮⳁ㙀灠曨㙷⠈Ⳝ䁄栄燀Ҩچ蚀ႠݠᗀႰ䱇椨ڄԖ硨栈桠⪢ᣐߐ噠䬰䡁Ҡ䙶⪡ᣐҰ䟍䣀㙁▰晠杨孴ݠᗀ竐䡁Ҵ晨屢ᯐႨކ蚀曀ᖭᒩ㨀Ԁ讄鹠Ꮐ㙂ᨸ晦杣憛芭暠ސ㡁Ҥ䛶ᗀ㙀■橠㝄蛀ᖬᘀጠᄀ㚬㤘Ң晰ݠᏎᗀ㙀盋㤘Ң晰Ⴜ䁂栌燀ҨҦ蚀ቭ㢛Ҡ栄燀Ҫڀበ㦑▤鉤ԀҰڄ⠁霔⻄腠ڀԖႠ㚪㤘Ҥⵄ腠ڐበ㙁䃈暆蚀ႠݠᏂᅒ䅁ႨҨ䄉屠ހᖀ汭ݦݢ詠㝆彰⭀ᙔ䝂ᄀ■躐Ԅ麂ݠዠ䅌ݥ湠亁洂晰ݨ◠ᄡᖵ⠀晤䙔庂ݠጠᖶႦ□ᖀ㦠㚀噤㳃㫓虠㚥㢸Ң晰Ⴅꋠᓁᇻ䐜䴀䙀罠ݠᖠ皀Ԁ醅繠Ꮐ㙂䉴ᘃ䫖虠■洠䙀虸卦澍晠䛀⻀晨䄉屠Ⴄڬበᦀ馅繠Ꮐ㙁ҥ䑚ᄡ暠䕐䝈㛁Ꮢᗑተ㚒宀橰䝂ឆ禺᧽裢ꐊ㝀㚀◂ᖐ曢潤ᚨ醂ݰڈҩ堔仈ᛆ融晠㩁ұ䟠㩐桨䚁䪂ځ⠠桤⡄㙔☢ᖠ䛤䝂䛀ݰ◕✌ҡ䙈ڄᖠႰڈҨ㛆膳仨ᘚⳀ䜘䯰ҥԀႨᛆ龍晠㛀ݰڨበᄠ■晢獤䙐Ҥ⪤Ҵ终◌晠乢ᖑң䙁婰ႨԌ晠㚩⋀■◁洂晰ڨ㹀⥁Ҩ⎺轁癴ⵄ腠ڐበ䜦䯰ҥԀᎨ婥ᔙ㴀Ԁ蘭暠တ罠⚦Ҥ潭ݰҨڂᇤ㓤腠ݣ競虠⠀晨㸶睰ߘᖀ䙀⋀ᖇᓁ霐麹ҩቦ鲂ᇠ朽◓澜ң令ቤꛁ炩陠ᛀ䙂㙒ᖄ晦骂ᇸ杰ᖀ㣀㚀噤㳃㫓虠■橠嶃噰ݠቶ䝃㙀湠⍠䛂ҹҠ鉤⫠Ұڍ暡桠ႠⲘᖐ⪒ᒀ柿蚨ԄҲҩҤ暀Ҵݢᗁᖐ⠺ᖀ晠乢▱Ⴐ䙨頔亂ݠ☢ᄧ⋁湠䩀䳢◙ҡየ邈Ⴀ☡栀㡀⚨㙰ᖖ䙀㩁ᯈԄԂҢᗱ窰በ㩁ᒄ䚠ተ㺠⫬晢䝄ᇠ□ᗀ塠悐婨ᚾ䙃䛀胨ڥ晠Ⴐ㝅ꖔⳀⳐߐ䚍䡀䡋ᄄ䁀䁠ᇠ机橠橷ጨ婠媠ᗁ꜠芰䢎橸ᖇ晡袠ᒭҡ皯钄Ԓ蹠⚤ꗢ杦恰ߋ䙀㩓ꈪᖱ轄飒䜀䙱Ҩ蜰㽀Ⳅ♴⤢ተᄨڭ崂◉ҹᑾ邂ᒆ晢蟄ڂԚ㹴ڀᖬҠ☠躏鬂Һᣁ㤤䙃䛸㢜漀橢Һ▜ᑢ杲悀蚀䑀⎲ԁ婠⋂旑㙂⥀ڈ㨷⠈䀐晨占ހ瘼亁涧㧓潦Ⴁ橠䥆暢蚨ԄႠ㭔☠杠㛂ᒀ䞤ڒҲ扱ݢԁᆐᄨڄ䚄囈ᖰᖖ杠㛁湡䪀桠⥑噠ݢ暨⋀椨ݤ㚒ҩᖌ㲀កႰ߆誀䡀㽀ᘀᰖ䝁ᣐቱ䟠㡀ቨ堈癤ԁᔁ㙈ڈ㝄麂ݠጠተᏐ杣ԁ塠㡨㝁በ䝄ᯀ椨ڈ㙷⚨㩉ڀጡ昕㚀辀橤□ᖐ晢䝃ᯀ椨ڈ㸇⚨㽄ڂᖠݰ朠蹤ڂҹ噠ݣ旟䭵■躀㳢虠Ⴆꗾ烊㙁皠玥晠ቭ꒽㬔䙃䛁胫Ҡᖛꊚ倈桨䙃䛂䃈䚤ڤ⪃仨⪺ҫᣐᄱ䟠ԔႠ㛀ᴘҠ䜟蘲玤㚂Һᖅ窢ᒠᐠ蘺檠眰ژ勠㒀ᗋዠ㚀ᖠ塠彠㟬橨䝆ᄀݰڈᖐႠޔڀ䡅㙂皠輣婰䇊ᖅ籼በݡᑐ䙄㚢ԁᖌ㹂⤠ዠ暽檀塠䡈ᦉቢ鲁ᒅ湠躀㳢▹ҡዸ邈Ⴀ◡ᖀᏀ㙡ᖔ晠乢⪰晠湠婢Һᨽ窤ᓅ⋀湠ᖀ硠䞀◠䡂څ⋀ᑐ䙡霔▩ᖌ晪柠曂ұ栀㡀ႠᘀᗀᖨႦᗀ虡癴□ᖌ⋀䙃㙃㟁▨㙀麹ҭቢ邁ᆐҨބڂ晰暤በ歭ҥ湠躏鴂Ԓ䩼㱘Ⴋ㙁樢詠Ꮐ㜁Ҥ晤䙀䛎䃊ڀᏀ㚠橬ҷꔆݣ䘐䮨㹈ᰀݠڐበ㝂皠咄䚡罨仠◠⇪㛃曰ᖀ穰䧊㩑ݢԁݦڂ蚨በ㡈果☠䙁㙁ᖁ䩡߀◹ҩ⠚Ԁᄀ朼䩠蚄Ⴀ⚥ꗔ杣䫂㙈Ԅ㚐虨勠ᘂꌑ㛄湠䩠皔Ⴀ䛀⡘Ҡ䜟蘲玤ڔ▫伐Ҡ栟昅䃈ވ㙦矀ҡᓾꛊ孰ᄰ䚭䤀Ң⎝ꖔ邁ᖐᄰ䛍䡐你䭅鼴䡉⋀ᑂ詠誰蹠Ⳁ晰䙅㱀Ұ幏鬆睨䛀⢂ᅊ㛂湡溏鴂㙰婠㱖䙇㙄䃈䜡嚄Ҳݠڐቨ䣂㙐䙤㚒ҡԈ晢䙂▾榠䟀䛰㡀⚠ᘀጠ㙀㚃ⵅԀႰ㻀㓖ᗀ㙀⥀Ҩ㛇☈㝄ڂកᒐሚ誠衰恨ᘀښԀ㝄▢◀嫁聨㐅ቢ酮Ⴀ曠蟈㙒◉Ҡ晴䙁㙁ᖏ䟠朠人ᖀ桮䙆㛂楠䞤ڤ▫绤⡀ᴁޕ㚀唤㚰罠㭄ᑔ䝅㙀㚇ⵅԀႨ䛀ڐቤ㛃■ᛀ䟂◨⚠⋀䙅䛿胨月眰⚠䫀⬀◈Ⴈᗀ䙈眰ښᖄ䑖条㛂湡源▬䙂㹴ጠԀᛐڈڂᕐ蹩Ҡ癤㹠ᆐႨҥԁ螠◐䡆ҭݰҪڃ桰⚠ހᖰ䝀䛀◡䚏隔Ⴀ䋀⡀␆⋀注ވ㙖睨㫀ڀᰀݴݤዠ㙄仈Ԍ晪柟孥湡辄㚐虨勠ڐቤ㛄■◆ᓠ㙡Ҡ聠䙡ᘠ暨䛤Ҥ▩蹠暠Ԁᛐڈڂᕐ蹢ᖀ桪䙆㙃脨暄㙠㡀⚠ᘀ条㙀⥀ᖄ䚢Ԓᖍ⫶杣开暺蠠䙀▰卤ڂዠݰ枣ԁ塠⠈᧸桪䙁䛀胰䙮衰㚙ҵቢ邁ᏐҰ䧍䣀㙁ᖘ晠乢ተ暨ҥԁ杨䉉Ҧ暀ᐠ蘺檠窰蹩Ҽ晢䙆㩁ᖄ䙠ᗐ蹠卤ቾ⥁ݰ枨Ԉ㹈ᰀႸ䁀䙀㩁ᯈڤڂҡ䙈庰ቬ☡晣䙄Ң晰雤ᴀԈႬ◡◀ተ噲ҭڀዠᒣᓀ䩀詰⥑ᖘ晨䙁㙁灠桢㙐የ婠㲀ᴁ昕■澁癰罠ݠ㢴Ԁ㙀▢⍠䚄■抌晪㕋㙀⠀楤Ԓԁҡዸ邈Ⴀ⠀柢㙰ڞ陸ቬꙂ䙁㙀湤Ԅ◪扱ڀᒠႨᘈ暡癴■抍በ䝂䜀䙟◁ᖐ曢潤仢▰侕㚄◁Ⴅ㦓卥镂柝孱ڐ䙈㝄◠枩ቤ髋㝂湡䩀㫱罠ⴔ䁂杰㙁皡ⵈ㝄◠枩ᑶ邀ᇥ洰䝂គ◉Ҡ䜨䡁㙀橹誠蝧⚨㙉Ҥ晢䙁㙀湠䩀㡁Ҥ䛼此䙐ᆈމ霰⚠㝆融晠㩁ұ栀䡀䡍墻Ҡ乢ԃᓀ詠来终䋀◀趂ᔐᆚ檡በ储婼晰䙅寰柨ဈ㹀㢈婰晨㙛ᯂ椨Ԃ⇲◁ҵᒀጩ⋃□ᖀ穰䦒捤ڀᖠᐵ盀噡ᘑ终㫀ጰበ㝃□ⵈ㝆睨䋀⢂䖪䜀䙁ቪ䡐䡈ݨ⢊Ⳇ㙂湡玤䙒ԁҹ粤ځ底☠洠䚂ҩҨ䜢杧䅁ႨԄҤ⨣亡裢ԖႢ㚭㤘Ҥ㇄腠ڐበ㙂□鏍䡠ᇰ□ᔡ㴀Ԁ骅繠Ꮐ㙁▨晪䙅㙁㤆贠䙄㐄腠ݣ延虠⠀晤䙢ҡҨ晠煻䅁ңᄁ塠坠㯬橨杰䛄ᖔ澁皢ҩҴ䜢䝆㙀湡䡉በ坠㚁㚀ᰀቨᓃݡ婺欖Ҡ癤Ԁᒵ☡橠笰躁Ҥ晪㚱㛂■䩀睤杠㛀⬀ᡋ㝂皠咦蚀䡍䢛Ҡ䙅䅁Ұ屲鉠Ⴀ㜘ᖀ⪣ᦀ辅繠Ꮐ㙁ҹ窤ᰀᐤ榠蚨በ坠㯬橨杰䛄ᖔ澀橢ҩҸ䛐杠㛂㚀ᖠ蜠◹Ҥ晪㚱㝃□ቮ㡐彠ᘀ⠠満ᒐႤ⠄ڲԙ䙈☢ꕱ䅁Ⴂ躕濌ҡҸ鉤ځ碫噠ᖀ槀㙀器㲀ᗁᰕ⠀晤䛒Ԃᖡ窰በ㝂㠁▤ڂډ繨㺀⛀ቻݢᆀ㛴Ⰴ畠ݣ㫓虠⠀晨㸢Ԛᖍ鍎鞖Ⴀᑈ߈㝄◠枩䑈暀ݰᄤ㑤㚂ҩҴ䛐䙄㙃ᖒᖀ桠因媐ቶ䙁㙄ᖒᅄҰ蹸勠ᰀᄂᐢ榠䩀硠Ⴀ⭀ዠ趡技蕨Ԃᨡ膱▤晢䙃䯍橼ᖀႠ囘勠ᗀԀᆐڈԄԔ缸栠媠Ұᒅ湠桁塠☢黈晢㚳᧹柠䛏颐ቪᇨ橲䩀ᄀݰڈԄҲҩݢ⥁ݨ㱈柀橢ښᖝ竣㷀虠⠀Ҧ虠Ⴀ卦䝁晠㫀ҭ虠ᖙ艦Ҡ桴ጠ㙃㚁㓈㠲ԋ䏬橪桟ޘ禣䙄ڤ仈⚧奡晠㛅㛰䘿ꡟ鹹Һ胤┦晰ራ僡癠㡀⚠晰杠䵂㙈Ⴁ癴▩ᖨ㹄⤐䟀ᑈႨ㙑ᑁ◉⠚ᖠᛐቤ㐣䛲ڊᘡ窠កᒐሄᛀ䩂ډ䙈盪ᗀ㙄皢ⵄݴ❃伀ᖀ屢Ұጨᄅ㙢蠘⪠ᘀ䙂䛀芣䙄ݴ⪴ᒐڬተ㙄盠浀奢ډҨ鉤劀ᘐڍ暥በ潠䭄䜔屢䉐ጰ䥍䡀灩䟨䙜䙉㩁ᖐ嚰⬀ደ婨晲乢㑢榠ᖁ㣀㜀晸㱖䙉䞅蚀㙖ҳ幰雠㢀⤶Ⴌᒁ蟄ݲ晰雤⬀⛈Ⴌ◡䚈ԄႠ㝄ᑢⳀ㙄灠橤㚲ڊᯊᆈԖႨ▢亠䦰㿁Ԅ晨屢㱐ጨڦ蚂杠䫀㣂㚪䅁㑈ᄈ㟆睠䭄眴㙎㙄灠桨㹨ᰀႸ䁂䙉㩁⎱䟠በ澠☀䙌⤠ᘡ䤠㙐⤀❘☐晲䙋䅁ᯈ߈眰彠㪀⪸⎫㙄灠槤ڒԙԄ癤㹢ᔐጪڄበ潠仠㙠㩍ተጨႦ蚃Ⴀ䫀㚬ዬ㙄湢洠䣂ڊᗡ窠⛡㩵ᖍ曨በ廠㹬晬ᗀ㙂橡柄ޑԐ噼㳂⛡ݨ㱈月眰䝀㫀㪒Ҡ䇀Ҩވ㛆睠佤㜔占ҽҠᖁ㡀倐☀晲棩暠䙤Ԇ隁蝠加⪸ᯋ䛅皠䡍噠聮ባҠ杹䜘䙰Ңᕠڙԁቢ㚫ҥ盘癸Ҥ♑ԅጰ邡暠噠◟▬Ҡ朜Ҷ杩䛀橺虡塠梈婠晴㙆ᣐႡ▤ԑԐ勠ᖈ暀ݨᆂ詡㣀㜁ᖄᘀጠ㙄灠槤䙲ډ䙈暤ጭዠ■䩡䜀◹ҩ⠈暡ݰ棨Ԃڠ虨勠ጠᓁݰݤ⡤䛤仈ᖬ晠䙂䅁ႨҤރ噰ݠ㣂曋㡀ᕂ詠䩐☣剠㸼ᖁស漠◆⍒㙙㙀晦构孰ڍ暠በ䁈Ⲩڐ䙃䞀䙠㙐ڃ幸䛀ᴀԖႰ■躀ᓠ㜁ҭበ屢□㙀湠䩂ұ䙈㚄⡅ዠ■溂洂晰ݨ☪ⳁ㙁⠀晤㙒ұ䙈䚂Ԁዠ蘺溟ꡟꡘ᧥ቢ邂ᔐ杠蹤Ҵ◃伀ᖀ䡅ዠ■譠䡂ҩ䙈ڀកᆔݩᛀ䜁▸Ԕ▶䙀㩁Ҩڨ㛆睠Ⴄ♴乢Ҩ暠ᇠ塠ቨ䟨桠䙁䛄䃈䙤ڄ⪛仨►ҫᯀ椨ڈ㜆瞠■橠歭ҰҰ䛮桰罠Ⴅꗔ桟ꡟ瘼亀㳢◙Ҩ癤ԁݡ癨Ԉ㚆瞠■橠ᗀ㙁灠橤Ҳ晰ݠڀᒨႲ⠀柢㙰ڨ⫬晦䙄㙅䃈月㠆矈Ҡ驠亀ᆐᄰ䛍䣐㙂☢㢮ᒈ㙂皦ⵅԀႨ㻀ᗐተ㛄㚀ᖡ㩐ႨҩҤ晢䙐ᄰ䣍䣀㙂ᖅ籼በႠ椨߈㙷䝀䟨橸乢ዠ泱蠀㡀螠■癤ԁᒅ皠䩠ޒҹҸ鉤㩠ᆐҭ暢በ偨栈癤ԁҡ㙀湠䩂Ԋᖱ窰በ䛀脣暠Ԁ◹ҡቦ骀ᖵ☡歠䚄♲䉴ጠᰈႠ⠀晤㙀聨ᘄ㡖䙃㙀⻀槤Ԓډ繨嚠◀Ꮤݠ◀嶦睰ހᖀ䙃䛄䃈ҥԀ䛈ᖀ䁄䙁䛄䃈䙤ޒԂᘁ窤ᗇ⋀ᑂ躀ተႠ䋀ᗐቤ䫑ڑ䟠㡀㾀☠晤乢Ұሐ䚮洄□Ҥ岤ᄈႠ■䭀䚂ҹ䙈溰ቬ☡晱䟠㛴▩ᖀ㲀ᓁ㹵⚠ᖀޟ晸ᖱꕆځ㙵滢櫠በ睠ᙘᖈጠᄀݰᖀ㚄Ⴀ⪱ڀᒡᔐݨ䝀婢ԙҥ㡚ᒠᖐҨԂ⎢㚁Ҥ普䙇㙀礦誡㡀Ⴀᗀᴀ◀ᘵ◢ᖀ顠熹▼䁀⤋ᄀ□漁癠㡀⚠晢枤孱ለԈ㩆睰䝼☠䙁䛞㢃䙤ڤ⪛令㺀Ԁᖵ◣䩀㡀你㫀Ꮦ䅢ᖆ曠蹤ߒ晠ݠ㼢䡂䛀胨ԍ梀彠ᘀᙘ䡉䫆栨ငԔ终䛀◠កҰڄڤڤ⪛仨⪺ҫᯁ椨ႤڱᓰԌ普䙁◖晢詡ᖗ駩ᖸ晰条廰樠蹤ߒ晠ݠ㼢䡉䛀胨ԍ梀彠ᘀ㤘䡉䫆杨ငԔ终㫀ᗀ✊㛄皠ᖠ顠桨ᛜ☠ᓀ㙂□鎤䝂ԙԅ窤㝭Ҡ■ᖀ鴂㛑婠ဆ恠Ұᖐ䙭䡁⠈ᦈ聠Ԁ⛀暺氀ҧ䀐Ҡ晼䙇䛁䃈杈霰ژ勠㳂ᅊ㛅湣蛨በ䝀䏨普䙉孶晠ᖀበ憱婠ဆ恠ҥ湡ᖀ硠Ⴀᗀᴀᰀᦃ榠ᅁ塠硩ᇨ湠㕋㙅㚀⍠䛂ڒᖑ竣ݥ虠▢溁⍄㓤㵀Ԁ嵠ᦀꇀ鹠ᖒ桯桳Ҡ㙾ҥ湢䩀靦陠勠㒀ᒐ峠ᑳ䛀㚇齠ݠዠ鞁Ⴁ㙀湠䩂Ҡ栀䁀䙀㩁Ҩ䚠䩂Ҡ柙⠈暀ݰߚ檀㡀Ⴀ⬁誤ځ粫噠ᛀ䙄廈ᘀᗐቤ䛁芰䚨霰㡍㢛Ҡ䙁䅁ҨҤҲҰ析䑖䙁㙁胰䡍䡐ڠ◌晦柠ᄇ杰ᖀႡ绀ᖬ晠杬孴ݠᗀ桠ቨ䟨癤Ԃᐣ杰ᖀ硠䟰◐晨䙅䅁ባԁ婹䫞ҡᒩ㨀Ҵݠ●衠䁈㐙镂屢ҥ湠桫嚤Ⴀݠጠተ䱆ݢ蚨ᖛᘶҠ癤Ԁᄃ杰ᖀ䩚謖Ҡ癤ڇ⋀盋㤘Ңҡ繨ݣ䫖虠㚩㤘Ң晰ݠᑔ䡁䅁ҨҤұᏀ抍ᓡ㴀Ұҭ暠ᖚ欖ҡᓑ㴀Ҵݠᖀ㳢㙉繨ڀԀހ暼洠䚂Ң⍒叠ԈႠ㠃䙨䂉屠Ⴄڬበ䜖䯰Ҩ㙃噰Ԝ㲀ተ姱߈ԍ䡐▲ݠ⋃Ң䷢㙈ڂᇰ虨勠ᘂ⬪㩁Ҩ曤Ԅ◣伀ᖀ䡂䧂㙈ڄڃ噰因◠ዶႤᒀ䞨㾉䑀Ⴆ侇晠㩁Ұ嘤Ԕ▻耽裌በᣐҨԂᛂҢ⍒叠ԈႠ㠃䙨䂉屠ݠᎬበᣇ椨Ԉ㹀㢸㝀晠䙁▭ᕂ詠㩐䇱▩ቦ骡璩陠ⵄ㙐㨺ᴒ䷠ԈႠ☠躀㡀㧡▩表暀ݴݢᆀ㛴Ⰴ畠ڀዠᇹ⻀晤Ұ罨☠ጠԖႤ■橠ᓠ㚡Ҡ晢屢ᯐҨچ蚀暿马ቨꚣԀ鹠⺤䙢䙁ҩጰ邀ހ橺歠䙂㙙繨ڀጡ㙵■亁⍂湰ߜᯀ䙂㙀炠晦隑杠⚤䜔䙂䛌䃈ڢሐ㡀⚠ᘀ䙂㳀ᖈ暈㙤恨ݠᏂᅑ㇂杰ᖀᖐᇰ◀晠桡䇁ңԁ塠㞨ڄ桢ጠ㙁⠀步Ԁቬ⠃■浭Ұݪڃ檰蹡Ҩ癤䚅⋁椰䝈㙑ᑁ▭⠚ᄀᆐڎ晠በ㡔䡂Ⴀ㙷Ⴚ■橠姀㟁ҩᔠڪ㙁㚊ⵅԀႰᙘᖀ䙂䜤Һ橠䩒ᓑ䩌ڮᒀ㙁■殀埣幺ݠᘂ☊㙁㚐⺤ұဈ⚠晤占ᖑڐ䚈衠⠈᧥⣤Ⳁ㙁⥀ᄄ㚔◡ᖑቢ䝁ᇠݰᖀ㡀䡸婠ᘀጠ㙁⠀灥Ԁቬ⠃■浭Ұݪڈ檰蹡Ҩ癤溥⋀椨ڈ㥆睠㝄ዠ䡠Ⴔݬᖠ圠◺␂ᣀځⰀ門繠Ⴃ陠勠ጠᓪ㙂瓠ҤԂҪᖅ窤ᄖႼ■橠䩔ᓙҨ癤癰㓐ݫ䙀ዠ䡈⚸晨条异苣䙤Ԃ蹠ᘄ⡀የႺ◡ᆀސڙҠ晤佣㹛曠ᖀᖐ榱ҩᎰ邈Ⴀ⻀晡塠㡏ҡ窨үᦀ桰䙢⍐ښ␂ᣀځⰀ門繠Ⴃ陠嘐ᯂ☟㟀㚈⺤䚂䙁ҥየ邈Ⴀ◢䩀㣀㙁ᖘᘀ䙁䛂䃊ڀዠ恨㐑⠈晬ݥ湡躏鴄㘿ꡟꔂ鞂ᄀ暺檠婰懩ᖔᚾ䙂䛃碡▨㙂▹Ҹ㹂⤠ᒠ畺檀䡀䁏詟ꡞᓱ㛄㚀ᖠ嚔Ⴀ♀ᖀ䙂䛼䃊ڀበ㡋栈癤Ԁᄀ聺歠䙂Ҳᣁ窰በ㙁㚖ⵅԀႠ⚥䜔乢Ұݰ佭䣀㙁ҭ笴郊宕䃚檀塠㡊ᇬ桤䙈䛼䃈条癠罠⚥♴⤠ᐢ榠◀洂▰Ⳁ晤乢Ұߚ檀塠㡈䟨桤䙅䛿胨朁癠纸⚠ᘀጠ㙄瞡▤Ԓ▰噤㱄暀ᔢ榠ᖀ裠㙠婠晦杰䫆曢詠塠䆑▨晦潭ݥ皠ᖠ嚄Ⴀ⚤ݼᗀ㙁㞁▨㙒◈噰㲀ጡݨ㱈月眰⚠☤ᯘᒋ◁晢詠䩐☣剠㳂ᄁᐠ晨䚡塠ቨߘᖐ䙀㙁珠曤Ңԉ繨ڀᖠһݡᖀ橱榱ҥዠ邉Ⴀ㐀虤ڄ☣仠Ꮒ☊㫁ҭ蛀በ䝀ᘤᖀ嵣ᖐႰ䛍䩞ᗞҠ晨杨孨ᑁ▨䍈豠Ⴄ負ᗁᖵ㚾㞸ҤⲤ嵠Ԁ啠ᣐႰ䩍䢀ڞ繬ቦꚣԀ牺誠䢀ႠႤڬቨ㙀㛀䴠䙂Ҳᗁ窤ᒠހ桺殀䙃幸ݠᗀᄉႠ㐀蝤Ԅ♣仠ᘂ☊◁■歠䟂㙈㝀晠杠㙀橨柄Ԅ⚣仠ᴒᒀ䇁晨ڄԂ湸䜜ᰐ䙂䛌䃄┄䙔⪤ᒐݮᗀ㙀㚁ⵄ㚀䁀⚠ᚾጠᄀ■亐Ҵ麂ݠᘂԖႶ■亐Ⴄ滈ᘀᏃݠዧ榠橠䡀⠉ꑥᒀᅒ䍀⦨ڄҴ☃罧晢颚Ҷ■橠㩐娒ᚽ裣ҡ彽ҫ亀圠㺙Ҡ癤◂ᆐႪڀᗠ䨹Ҡ晦㙡㙀⠀杠硠㺙Ҡ癤ڪ㙀瓠ҤҢҡ䙈㛂ᅊ䅁ባڡ塠㝀ᛄꗢ柠ޙ㓀ᦄԂҪᖙ鋣晡彽ҫ◀䜀◹Ҩ晢枟开虠咧䙂齠☠Ꮒ㢶䜸ڜ涠ᑂұҥቬ鲡䗸盀Ԏ䧠ᅑҨ晢杬憀瘼亐ҷ㠐ޕቨ⤡ݰႪڀበᄠ◀橦醀ބ杰ᖀበ㽀ᗀ檠ԈႤ◠蟄Ң晰ݠ⍴䙂䛖䃈Ԃ⎡睠ݠጠᓪ䅁ቢ詠䩑榰杌橢柠曂ұ蠀ސ罠⚤蜴䩀᧨߀䙯顠☠諠ڀᄈᄆ☠溃␂Ҳᖡ軣ݠꔃ芼橠䩐樒ᯃꊦ鞀ᄀ汽璮䦠ҡҠ晢栰ԕ⠀晤䙤♣盠ᘂ☔䜀䙿ဎ㵢Ҳᖡ鋣သᇸ湠溃┇㧑繠◠Ԁހ魠ⵅԀႰ⚤坈䙂䛄䍐噰㘀懫滠ᘂ☖䜀无钄Ԅ♣耩諌Ҩ㙀㚃ⵄҴ㔀ᇨ癤Ԃᄀ汽ᖀ䩐樂ᯂሸ┑彰ݰ䝎詸▐㐄晤杸憙䋍晠በႠᛇ幠邈Ⴀ☠溃␂Ҳᖡ軣ݠꔃ芼橠䩐樒ᯃꊦ鞀ᄀ汽璮䦠ݡҡየ邀ހ鹠ⵅԀႰ⚤坈䙂䛄䍐噰㘀懫滠ᘂ☖䜀无钄Ԅ♣耩諌Ҡ㙀㚆ⵄҴ㕠ᇨ癤Ԃᄀ汽ᖀ䩐樂ᯂሸ┑彰ݰ䝎詸▐㐄晤杸憙䋍晠በቨ須晢案ԕ⠀晤䙄♣盠ݢ☔䜀䙿ဎ㵢Ңᖡ鋣သᇸ湠◃┇㧑繠ҷ酢ݡ蘠湠䩀㡀⚠晢杩䷢㙐䡈㛁Ꮡҥ㱚ႬႥ湠በ㡐㺠◍ዠ杨◉◠䞨㹈ᕢᖡተ㚒䛊㚂ቪ䳤☢ᖠ䛤郋䛻芰嘍䡠䡈Ⴄ䛂▰侀曽⺤䙢ұұ㱶䙁寰ҳ䟠በ⠈曠ݢᗪ䛈㚂ቪ䩗膱ҡ㱶杨◉☡ⵈ㝄◠枩竢ꌊ■滠漁癢Ұ栰桠ጠ㙀皿鎤䙲ҳ歴☠䙀㛀楠䞤Ԃһ佤ڀᅋ廨䍈䚈㝄◠枨桦䙀◓湠満በ⚠☠ߖ䙃䯍胨暄Ҧ罰❌桦䙀●㞁▤ҲҸ枀晠䙂◄■ᖀ䝀軀ᖬ晠乢Ұ晨Ԅԓ噰㛀ጠԀᄕ⻀晡塠☢麔ጠႰ姱ݰ䡈㛁Ꮡұ竺ⳁ㙀湡ቮ㡐Ⴀᘀ◀満Ұݨݭ墀䛂䛀ڀᖐ⋆ڂ詠坐罠ᗁ負Ⴐ啭ᑯ䚀㙗齸Ⴇ虠醂ቲҨݨ䐈䑀ߘᖘ䙄㙀⻀杤ڄ㔤㕀ڬቴ㙂■䴀䝂Ԃᯞ䏀ԖႬ□◀䦠㜠⚠晤乢Ԃ杰ᖀ橼虣佤峌በ㙂㚱ҭ䩑耐■晨桌ԕ㚀贠䙂Ԃ▰鑤芀ዠꇃ繠ᓠ㤁ұዸ屢䑐Ⴈݨ㧆砐❀㹂⤠ዠ牺橠䩑ᓑ䩈ڮᒀ㙂㚊ⵄԄ◣伄ᖀ嵣ҰႨڅ㙠ᇸ⭀晨桌ԕ㚁⍠䙂Ԃ␐ߔ杽䅁Ҩݨ䌀ᓒᗬ鉤Ԁዠ靠ⵈ㟳噰ݠ☤ᖷᄎ□◙⚌ҡ繩嚠ᗁ㑛ݯᖀ桠䡉蠈鉤躀ተႰ䩍䦠㣀勠◠ᗁ◕⻀潤ڂԂᖡ竌ጠ㙂□◃⍃噱蛠☣繠孰߄☠ޜ䙐ᖡꕆځ㙵滢䫀ԄҲҩҤ暀ᒢ榠ᖀ棠㙂ᖝ躤⏀ቴݡ⻄䛄▢䙴ᴀᖭҤ◡◀㡐睠䙑ڀ▰䧑Ꮡ䟠䛲ҡҤ晤䙃㙅▢በ䡀彠㠐橦杠䩆朠湤Ԕ亂Ⴄጢ⤌ݥ湠表颀肈婬㲀␁Ԅᓀ蚨በ庂ݠ㑠涂ᯆ暨ဈ㙑ᓘԌ晲杠䅁Ⴈᄈ㙃噰䛀㣂ᗪ䜾䟰Ҥݴ◣佧䝏晠▻晢詡ڄቨᘀ⚈䝎㙅◠橡ተ䙚ݠᗀ⏀ተႨဉ堒㚩Ԍ晦䙌㙃湣桡桠㝀專桤䙄㙆脨曡癠纹Ҡ晢䙊㙄□䩀蝠㝀嚠⬀ᒄ䙐ᑄ߁塠梈婠晴㙆ᣐጰ䩍䢀Ⴀ㽔䑖䙈䛀橺虡塠䁈ᗁ籠⤐䟀ᑴ䚀㙷齸Ⴄ䜖䡂㡀ݰڏ隄ႠᛆҢ畤䙐ݰ䙆蚀蝠ᛆԀ畭ݰݨԈ㨷⠌ҥ諔ҭ㙁■亀跄㑀᧨驠⬁Ⴆݢ詠Ꮐ㚁▬晠杤孴ݠ♠橢ҡҬ䚈䙀㩁ቨ䚡塠ႠⳄᑔ屢ᖐҪڀበ䆑Ҥ驠ҬႥ湠亐■䢸㝀晤䙁䛟芰噠㵣癠拠ᗀᄡ⛛㚼Ԏ䧠ڡҨ晢杦憀瘼亐ҷ㠐Ԙ晤䙁䛆䏐乎㩘ҫ潈Һ杤ᯀ椨ڄҴ➻武Ң颚ҧ■橠㩐訒┠ᑤ恠ᯐݨԈ㚧塩ꑥᒀᅒ䍀ᓐ䚡塰⚠Ⴄ♴乢ҰҰ䝍䡠䞀■橦醀ބ杰ᖀበ㽀ᗀ沠ᖨႠ◠蟄Ң晰ݠ⍴䙂䛆䃈Ԃ⎡睠㛀ጠᓪ䅁Ң詠䩑ᓑ㙀㷦ቡᇿ漠◂⍒㙑㙀ᘀᎿᄀݰᖀ㩘Ҫ扱ڀጡһݣᖀ㩘ݢ䩴ጠᄡ暠Ⴓ蠀䡀㝀ᛄꗢ柠ޙ㓀ሄԂҪᖱ鋣虡彽ңᖀ䡀⠈䀙Ꮎ鞡晠苮晡穰㺠⫬晠乢ᖑ߈Ҩ㚆瞠□⪨暀Ұ߄ᘄҢ晰䛄ᯖ䙀㙁皠厦蚀杠ހᖀ䙃孰ڎ晠߀㺙Ҩ晢枟开虠咧䙀轠☠Ꮒ⇶䜠ڜ涠߄▰噤㲀ዠހ瘼亐ҷ㠐Ԝ晤䙁䛉䏐摠㵣癠因ᗀᄡᒻ㚏针㹀⦱蹠䊀ዠހ楽溇鵴⪠᧨驠ⵁብ溠䩀ᖐ䦑䙈ڀځᖵ☡ᛀ䙂㙛勠Ꮢᗀ㙀■詠㝂㽀㛠ᖀ䝃ᣐҪڀበ䆑ҩቸ邀ݨ䉆橠桠⚠㇈鉤ҫ㙁㚄ⵄ晠萐▤㔾ጠ㙁㚃退橢ҡᖌ㹂⤠Ԁ晨ҭ婰䇉▱窢កቢ㙈Ҥ㙲ҩᖘ⋀䙃㙃⥀ҧ䙀Ⴀ㽄ᑔ䝆㙁皠厤䙲Ԋ䩴Ҷ⤠Ꮠݨݭ墀桫頤橮邁ᆁ㙈Ԅچ睰㝄⎂ᗀ㙃皠佡癲Ԃᖍ躤ጡ⫸溢䩀橷觩▹ቨ邁ހ晨ڍ婱槩ᖈ晬乢Ұ柠蹤ڒԑԅ銠ᄈႠ☡橠䶇㟰■晢杤孰暨ވ㚆睰㫀⋒Ⳁᣆڂ詠驰⡀婠晨䝁ᇠ□䩀㣀㙁繨ڀᄡድ◠䩀穰䦑▴晦潭ҥ椨Ⴈ㙷⚨☠◠┊㛀椨ڀ橢ұҭ窢ባ䙐߈ԅ癠ሐҠ晢条孰暨ڨ㙖睰⭀ᘒⳀᣅ湠ᅗ蚀㙫ꊥꋦځ㹵满ᘀᖒ彨▩ڀڂ滇ҵݨበႨ䉰ቶᓀ㙂㚂厤Ԇ睰ⳅ鼴䙀㙀㛤䀀▢㙺⡃䉀ꕽ秱ᄰ晟隗⠏㙁芤ᴁޚ㚨硘Ҧ矘Ҡ鱠Ԁᇠ藺橠硠塯㙁缶桟꜡芰䙮橺㪾ҡ窾Ҡ䏀Ҩڈ㸆睨☠ݥꞁ釷篨င㙀蹠劌景䵢ᇠ鼠✀橢Ҳᨹ窤ዠዠ梺玤ں彰⭀⋃ꡟᇸ盙ҭ袀䁏㙁缶桟꜡芰䙮橺㪾ҡ窾Ҡ䏀Ң蚨በ䁈侜☠䙂䛿䃈暤ڄ◫倈晦条悀較鹠⍂鹠ဌҠ⪡ᣐݰ噍䡠㝀㝄㤔邀ᇠ牺涠Ҡ罠ᛆ罻晠䛀□◁㳢ҳ佤璠Ꭻ▤□◆⍂䙀唴ᖄᗿޟ■◙晦睨⭀ڒᒀ㛂曰ᖀᏀ㚁▥ᔀڇዠ■亘Ҥ滈ᘀᏃ晠䜶䡰ҢᓀڙҬ晠杬孨Ұ䙄㙒Ңᖀ鉤▫㙀湠◁洂㙋佦Ң恠ҰҨҥԀ杰㝄ᑔ䡂䅁በ湤Ԅ㑈ᄄ☠䙁㙁䃐乄چ绣拈晠乢ᖠ砺溁ᘐ䡁Ҭ晢㙀㙀⠀杤䙤㑈ᄜ䁄䙁㙁ᖛ覡塠ቮ㙁窠ᠢ㪃㛠㙐▨ᖆᕼႦ䙅䝜䟡ᖀ突檒⠂Ⴁݠ陿蜨ވ䛈塴ቢႡ陿栢䝈ވ䛈桴ቢሰ㗃㙂盦㝈乨▀䑎◠ᠢ㪄㛠䘀庒Ԋ⚂㝉ᘄ䇁Ҩڤұҡҡበ屢ᖇ椨ڈ䉀ݣ噠㲀ጡ虠ᖛ䙁悠㙈㰼晠桠䇁ᖈҠ乔□ҥᒀጩ⋀⋐䨤Ҵ㘿ꡜ㓖ⳀⳐڐ䜄Ҵ◣翼橤釖䛀芨ڈ㙗䦚ᚹ究䡂䅁⎨ڈ㙧䡍㢗Ҡ邁ᆐҨ䛀䩀㡀⚠ᘀ柸灀Ҫڀዠ偨ᘀᚨ䡆廢㙈ڥԀႨ⭀ᖠ疁Ⴐ߄ⲤҴ廈ᘀᴂቬႥ盆㢸Ңԉҹ諌በ㙁湠⍠䙀虸勠ጠᎴ㛂朰ᖀ塠偨鰹ቨ韊䛈䃈朥ԀႰ⚴䁄䙅䛀荨䛤Ԃ㙘柼晢浭ҥ椨څԀ杰ᘀ☌ቬ㙁□⍠䛂ԁҨ鉤⫠ተڍ暡በቨߘᖰ㕋㙃■⍠䙀罠ݠ⇬ቸ㙂□⍠䛂ԁҰ鉤⪫腡ځ噄Ң晰蛤▤晢䙐ҨҥԀ袐㝀晠杴䛈■◂洂㙉䙈ڄᒛ孴ݠᗀ䜐⠈ݤቸቫ㙀⠀杤䙢ҡ䙈㺄ᄖႦ■䩀䦠㚀噤㲀ᄀԀ橺橠堒▸Ⳁ晦䝅㙁☠亂洂㙙䙈ڄጥዠ■亂⍂▹Ҥ癤㙡Ⴅ湠栀ޒԊᖀ鉤ҫᄀ□♁癠㡁Ҡ晠乢㑠曽◔澼ң仨ᗐበ䧂㙈ݨ㝄♁Ұ癤㙠ԃ⍺橠㦠㙁Ҥ䁂⪢ᣐݨԆ蚀Ⴀᖴݣ㻓虠㚦㢸Ң晰ႥꋠԈႮ䐜䴀䙀麹Ҥ晨屢⪰Ҫڂዠ㙢ݠጠዶႨ■橠㦠㜀勠ݢ㪪㩁Ҩ晨眰Ⴀᛄ伴䙀䅁ҨҤҳ噰蚌㴞Ⴌ昀鞅繠Ꮐ㙁▩⠈暡邫噠◟顓噰ႤҾ⥁蒫噠ᖠ蚔Ⴀ☨ጰቨ㛁■䭀䚂▹Ҥ癤ԁተڐ䟍䣀㙀軠ጢᰀᐠ暺檀硠㚨ԍᔩ㴀Ұᄰ晃顠偯ꌝ㱶屢Ұቢ飠䙐婙⪡ዠ醂ቲҠ湠䩀㡁Ҥ癤ᖢᇢ杰◀䡐㺠ᖬ晢䙃㙀灠杤䚒ҹҬ晪煻㝁脭暠桠⚠ᘠᖀ䡅㙁胭暠በ䁨婤晨䙅㳀ҨԅԀ蝰㽄ᑨ䡇▷ݰڏ顠䞨ҡ⠈暀ᇠ暳䟠硠䞨Ҥ桰条㛁湡ᖀ礰ҩҽቢ顰㵐Ⴋ䙀ڄႠ㝄㜔乢Ҧݢ詠椰ҩԁቨ髒㛂楠柄ڄ◣伀ᖀ⤡ᆐႪڀ桰你☠⇬ቤ㙁□䴀䙄□ᖌ㲀ᄀᒠ暺洠䜀罠ݠ⡴ҡ㙀■趠ҢԂᗁ窨үᦀ晰䙈䈈䑀ڀ蹠⥁ހ暰忰扠ݡ癠㵒ቢዿ暿櫀ᖓᓙ▨湠䙁䛂䃈䛄Ҳ晰㝔☠䙁㩁Ҩ䚤Ԅ☣仨⢂ԖႠ■溠㦰㺁Ҩ晤杨孻ݥᖀ䩒榱ҭዠ邉Ⴀ㐀虤Ԅ⚣仠⋂☊㫁ҭ蛀በ㝀Ⰴᖀ嵣⪰ݰ䣍䩛誮Ҡ晤杸孨ᑆ橠橰榱Ҵ癤ԖႠ□ᖀ䣐㺁艨Ҷ䙂䛐䃈曄ڄ◣伀ᖀ屢Ұڐ䟍䩐ᇰ■晨佢Ұ柨Ԉ䙓幰㛀ᗀᰗᆌ㚃◀来杰ᛔ☠杬䛂ᖚ虡塠⚠♄ᰐ嵢Ұڐ䝍䡀㾀■鉤ԀԀ貂鹠ᓠ㙡Ҡ晢屢Ұݰ䱍䢀ڟ⪤ቦꚠҰҪ䚠በ㮪▮Ⲹ嵣ҰҰ忠⍂◈⚠晠乢ᖑߑ䟠ᖜҡҭ粤ᖠᄅ榠ᖀ婼▢䩑ڀᒠԀ楺檠崂ҩҰ䜠䁠Ԁ晭暡በ你⬀ڀዠድ溠橠㡀䦑ᖄ㹂⤠ᇠ陠ቭ晠罠⚧Ҡ畤䙁癨ބұҡҥᏀ醁ݰݰ乭䡠㡎ҡ䑚ҫᣐҪځዠ㽀❈橨䙃䷢㙈ݨ䉀ጸ㝀晨栠Ҩ䆀ᅄҢһ佤㼔䙁㙁ᖜᓄҢҡ䙈㚀Ꭺ䅁ባ蟄ԒԀ栘ҷ㕂ݡ蘨虨㡆罰㫐ݢᄁᒠ誄鹠ᖙᘞҠ癤Ԃᔠ暺洠䙀㡂│叠ԍҠႰ◛濌ҡ䙈ݢᅊ㛃ᒀ䞨䏉屠ႤᎴҠᦀ鶅繠በ堐■ᘀጠ㙃皠⚤ڤ▲吨䁀䙅㙂㓀ᒄڒҹ繨亠កႻݤ◐澜ҡ䙈ڄጡ昆ᓀ◐澜ҡҩቢ邂Ⴛݠ◐澜Ңᰒ䷠ԈႠ☠蛯驸櫾Ҡ癤ԀᏐҨԅԁݨҠ晪䙅㫁晭蛁በ偨䟨晦乢⠈晠◐澜ҡ䙈Ҫ䙂ᦀ蘺洠䙂Ԓᖅ㱚Ԁቦ暢虡墐ቨ栌橤䩀㙁■䴀䜂ұҠ鉤■᧼ڀ䚯颐ቩᇬ橤䩀ᄀ■亀㳢㙙ҥ㡚ԀԀ杺歠䙂㙊ᖅ躤ᖠᆐႨک堒㙚ᖠ晦杨䯍溠蚨በ◂ݠᘂ㺪䛀珠晤Ԃҩ繨亠ዠҴݠ⍠䝀虨勠ᘂԖႨᑈڄԒҲᗁ窀侀Ⴔݠݨበ㡈䟨癤ԂԂ榠䩀䣀㙡Ҡ䜖ҫ㙁⠀曤㙒Ңᖑ窠ᒶႠ■ᖀ㦠㙁ҩጠ還ҧ椤☀ޛ晨ᖉꕆځ㙵滠諠ԄႠᘀᙔ䡂㙀碣䙄Ҥ◃伀ᖀ䡁䛀荨曤Ԃԁҩ㱶䡂䛄■溁ᘱ罨▩ڀႤ䙐ߐ䥍䩐❐■晦䙁䅁ᛈڤҢ晰ߘᖠ⪡ᣐߐ䙆蚁ڙҬ晤䙃䛈䃄ងԒ晰ұڀᓁᖵ⠀晤䙄仈ᘀᴐቤ㙀ᖚ虡塠㾀▰桢䙀䛂䃈چ蚀ႠݠᎬበ㙁皨ⵄ晠麸杬ҷ幡ݡ䘈虨㡆罰⭐Ҥ暀ݰݺ檠䡀⡈婠晠杤孴ݠᗀ㩐⨡▰晤䙄㙁㤆誠䩐杠⚤㛖䅡Ⴁ㙈Ԁ橢Һᗡ竢ᄖႠ■詠㦠㛡Ҭ晠乢һݤᆀ㛲Һᖀ鉤㙋㙁湠橠婱ᓐ曼晦乢Ң㙈ڨ㛆瞠■橠歭ݰߊڀ桠ݣ剠㲀ᒨႢ◠䩀ᖐ䦑Ҩ鉤ԀҰڍ暠በ䁉ᇨ湠㕋◁晢鵠㙐䈹⪡ጠ醂ႲҠ湤Ҵ▫仨ᴀᄩ⋀■◀洂晰ݨᏂᅔ㝂■詠桠䂘鋨⋂◀ᇠ桲规㙰㡁Ҥ☠䙂䛌䃐䙦蚀Ⴀ☠Ꭼቴ㙁■ᛀ䙃噰暐ቶ䙂䛀⻀桡塠㝀⭀ᘂ㚪△湠歠䙀䡁ҩተ邈Ⴀ☠♁癲ұ䙈◠Ұ寠ᑈڅԀ䝈ᘀݢᗪ㙁珠晤Ңҩ繨ڀጡ㙵⚠ሡ坤㹀哔ቢᓿᄀ■亁鬰䡁Ҡ桤⪡ᣐҰ䙄Ҧ聨㐄橨邁ᆐႡ▤Ң▰Ⳁ晤杠䍀Ҩڈ㙖睰☠⋒Ⳁᣅ湠詠㡀䦙▥ᑸ鞂ድ◠橠橰⡰㝀⋀䙃䛀⻀晤Ԕ◃仨ᴀጩ⋀ᑂ詠㩐䇉ᖄ㲀Ⴄ䙐ڈڍ䡐►ݠᘂԚҠ■満㳢㙑ҥ㡚ҫᣐҢ鯠㙐䈹⪡Ꭰ醂ႲҨԈ㚆睨⭀ጰቤ䣂㙈ԅԀႨᘀᘂ㚪㝂㚀⍠䙂Ҳ▤鑦◀Ⴐݰ䝍䦠㛡ҩጰ邀ހ橺殀䙃幸ݠᘂ䚪㙀皢ⵅ㙠ᇸ⪠晤䙁㫁ҭ蛃በ㡈砉ᓹ➀Ұݰ䥍䝀缱ҭተ邀ቴݠ⍠䙂ҹҨ硦◗ႠᑈҨ㿈葠ߘᖈ䙀㙁珠晤Ԅ✣仰ҷ㵁ݡ䘀湠䩀㡀⚠ᚾጠᄀݿ躀㡠㽀ᛄݰⳀⳐݪڀዠ䡨婤晤乢ቱݣ䛄Ұ蹲ᖄ㹆⤡ᇠ晨䙡曀罠ᖴݢႬݥ湠亀㝅暹▩⠚ႬႥ湡ᖀ䩐⚠ᗁ䲄ቭݥ湠ᖀ㦠㙢ᖄ桢⪡ᣐҨچ蚀䡈ݤᯖ䙀㙁珠晤Ҥ◣仠Ꭼበ᧦ڀ暏陷靠ҩꖂᄀᄂ湠輎䡀㡏ꡟꔞ鞀ᄃ湠亟陷⠈ꏍ譄Ⳁⴀ暨ڈ㚷䮩▵ቢ䙁䜿暼䪀涪鉒☢㞎䙅㙁醿溤☪懱ҩቨ骀ዦ湠橠崤㘿ꡟꔆ燒彦晦橠በ㟰▰晠杬孰ڎ晠በቨ䟨晦屢Ԁ晢贠䙀茐ᖄᚾጠᄀݰڈԄҲҩҤꛁݱ߈Ԉ㙄曈ڨ晤乢ұႱ䟠䡀㞀▰橤ⳁ㙀榠蟠眒►ᖀ桢⪦ᣐႨڈ㙒Ҩ枬橤歭ႦႢ詠㪐蹰勠ᏂႰ剱ݣ䚁塠Ⴀᙘᖈ条㛀楠柈㙒▰勠ڀዶႢ㚀ᖠ園ҡҬ鉤ԀԀ桺橠㦠㙀呰ቢᓿ㟀㚠ԍ墀㽠ݠڐበ㛀ߐᖀ䡀䆒▜ߔ析䜫晨Ҩ㜷⚰㝄㫒䅠ድ㓀ҤԄ⪛令ᗀځ╅湠◀淂■婠㲀ጡ晠胨晨㹐⡸㝀晠柠ݨ䅀ᅄҴⳄ敠ݢዠႰߚ源Ҷ硨ݠᙖ㙈㙁盀ԍ䢀ڜ⪤ቦꚣԀ虠叄䙲䙁Ҡ癤ԁҡ癨ڄԖ硯ꊡ竢嚡䇐Ұ䠮㡠䡈侄岠ᗪ䍀Ҩڈ㸶睨☠ݢ㖋㙀㚁㔄㙀蹠勠ᘃҡ孱Ұ嚀㬰䡁ҡᒀႰ屠ᑈԈ䁈ꔀႤᗀዠᇵ㚠ԍ䩐Ⴀ❌䙐䙃䜀ښ櫠ޚ▨ݠݢԖႤ■◘晦硰ߜᖀ䙀䛞䃐晦隀ႠႤ輴桠䇁ҨҨ㤆硰ߜᖀ䙀䛒䃐晦隀ႠႤ弴桠䇁ҨҨ㞆硰ߜᖀ䙀䛆䃐晦隀ႠႧ蝯晠㫁ҭ蚩桠ቮ癡竣黧虠⡀晦隀ႠႧ幠邡暤噠ក䙃幰ݠݣ詠宀袂㹀Ꮠ㙁艨ڀڂһ朠ᅓ虰△ꌬݢ㚫㝁潠ᖀᖑ䦑䙈ڂᖂ䙁䘀湠䩂Ңᖑ窰በ⎡Ҡ䚡塠䚨⚤ڂځ邤陠ᆀ㛲Ԁ婤晠乢ұႪڀ桰Ⴀ㛠ᖀ⤡ተ߈Ҧ蚀䝀⭀☌በ㙁盓㞸Ңҩ䙈㚀ዠݶ晤ቤҠ罠Ⳅڬቤ㙁湠⍠䙂Һ⎂㷀Ԁݴݢᖀ䡀✈ڀ䚀ҫ柠暠噀䩀㡀⚠晢栟昕㚿蚎㩐壘㝀晢柿昕㚿蚎㩐墨婤晢枰孱ߐ晀㵔◲䩴ᗀځᖵ■洠䙂Ңᖑ窠ᄡ꜠芭暠በቨᚨҠ㕋㙀■争㳣癠ᖰᖖ䙀㙀益噍䧠Ҩ噤㲀ԀᆝҠ䞤Ҥ□蹠Ҷꎡޟ漠◈⍂㙩㙀晪䙁䅁ᒈބң噰䛀⡀ᒶႪ□䩀䦠㛁ҵጸ邡Ⴛݠᖀ穳覲ᗬ鉤Ԁᐡݭ蚣桠偬梟Ҡ屢⪰ᄰ䧆蚃䝀㫀⢂囊䅁⠈ބڔ☣伸ᗰ䙅㙂皢ⵆ蚃Ⴀ㭄圴䙄◂Ң销㙷齠ݠԀ馂Ԁ桤⡄Ҧ罰◡袢ځ窫噠ᖀ㡀㦙▤鉤ځ纫噠ᖀᓠ㙁Ҡ晢条彻ݡ◁ᖐ曢滤ᘂ㪁ᖈ㫈䚨㝄◠枨桨䙀㙀橼䩀桠㽀⚤㜖郊䅁Ⴐ忲鉠ቬቢҢ屢ҥ舠䙯颐ቩ栌橤䩀㙁■䴀䚂ұҠ鉤Ԁᄀ浺満䦠㙁ҩጸ邡ᔛݠᖀ䩠㟸◐晤栔激ҭ暡በ㡈䌘ᗈ䙂㙁㚈ⵆ蚁杠☠ᘂᗪ䅁⠈ڄԃ噱ݠᘂ☊䜢䫰Ңᗀڛ扤ᑾ䥀䛘䄈暤晢ұҤ鉤ᖠႰҭ暠በ㡈頉ቤ屢Ұݰ䯍䩐怐■晤桢䇁ᒈڈ䕉㑀ߘᖐ䙂䛃珠櫤ԂҲᘁ竌ቸ㙁■満洃噱䛀ᗀዶႰ■溁⍄⪤煠Ԁ橠ᦗ暠噄噤✣勨ᗈԀႰڍ暠桠㝀ߘᖀ䙂䛎䃐䚆蚀Ⴀ⚤缴杧䅁Ҩڈ䙣幰因ᘃ䛑虠⻀杤Ԅ◙繨溠ዠᄀ湺洠䟂ұҩቨ邖Ⴔ■橠䦠㝁ҩተ邡躨陠ቨ晠臀ᖅꕆځ㹵滠諠በ㽀ᙘᖈ䙃㙀⻀晤Ԕ⚃佤ᗬበ㙁皫ⵈ㚳噰ݠ⋄ዷႦ■躞♼ҡ繨㚀ᓁᔛݩᖀ塠䁉ᇨ鉤㹠ᆐߍ暥በ㽀Ⳅ♴屢㙐ߐ䝍䡀㛂㙀㳬Ⴂ旱晰䩍墀㝠ݠᏂ䊪㩁Ҩ䚤Ҳ晰蛠ᘂ㺪㙀㚄ⵅ㙠ᇸ⪠晤杰孰Ұ䝍䣐㙁艬ڀዠҴ曠⎀团ҹҩተ遰ᣐݰ䩍䢀ڛ鉤⚞䥀䛐䄈暤晢ҩ䙈ڄᖡᆐڊځተ你⚦Ⴁ橠䅁ᒈڈ䐈㑀ߘᖐ䙂㙁珠晤Ԃҹҵ竌ቤ㙁㚆ⵄԄ◣伄ᯀ嵣Ұݨڅ㙰ᇸ⬀晠䙂䛈䃄ቤҴ◃伀ᖀᗀ㙂ᖁ柄Ԅ⚣仰Ҷ籡ޟ漠◄⍒㙡㙀晨䙁䅁Ⴈݤң噰ݠ☢㺪㙁㚄ⵅ㙠ᇸ⪠晨杰孰ݰ䝍䣐㙁艬ڀᖠႴ曠⎀团ԁұቨ邀ዠ桺橠坡㹀叄ቢꚣԀ湺誠䢀Ⴀ☠ڐበ䅁Ⴈڈ㟆睠ᛄ䜔佢һ朠ᖀ䩑ᓑҥተ邉Ⴀ㐀虤Ԃҩ䩈ڮᒈ㙁㚁ⵈ䈈瑠ݠᘂ☊▥湠溄⍂䙀叼چځ㹵滠䫀ᖝ諶Ҡ聠Ҥ䙐ڐ䧍䩐❐■晢桢䇁ᒈԈ䂈籠ߘᖐ䙁䛃珠櫤Ҳҡ繨纠ᄀހ湺洠䟂ҩҥጸ邖Ⴐ■亁⍄㒤兠Ԁ橠ᣐڐ䱍䢀ښ詤ᑾ䥀䛐䄈暤晢ұҠ癤ԖႢ■溃⍂Ҫᗁ窲በ䇁晨ڈ㝆睠ᛄ㜔佢һ朠ᖀ䡀⛨■鑦◀ᄀ杺溜♜ҡҩተ遰ᣐݰ䩍䢀ڛ剤ᚾ䙀㩁ᒈ䙤Ҥ⪤ᒐڬቬᄀ■亐▬䙂䉴ݣݠ衠◠䩀Ꮐ㙁▨晠乢ዣᓀᖀበ㡈ᦈ鉤ԀҰҪځዠႠ♔Ҡ䡁䛇芺氀ң噰因ڀᄡዻ䃋䙀ተ◹Ҥ㳜Ⴂ旰Ҫڀዠ䁈㟨癤Ԁᇠ桺檠棠㙁□粠ጩዠ■詠በ㛁⭀◰በ㛀ᑈڥԀႠᇨ晢䙂◘⋈ݤҢҳ伸ᖀ杠ᦅ晠湠乒Ҫᯂᆈڇዠ㚀䩀Ꮐ㜁Ҥ晠杼孴ݠᛀ䝁▨Ԕዴ⤠Ⴆ暰䙁坐罠ހᖰ䙂㙁湠◃洂晰ހᖘ㝃ҥ砠䙯颐ቩᇬ橦䩀㙁皥ⵈ㙃噰ݠ⋃勭虠⻀桤Ԕ㙉艨◠ᒠݻݧᖀ塠ᇰ☀晦䙃䛌䃍暠በ㽀◡■⥄ݡ䘈ԅԀ䝈☠ጰበ㛁皢◀来杰ᛔ☠杨䛂ᖚ虡塠⚠♸ᖈ䙁㙁珠晤Ҥⵄ啠ڬቤ㙀■䴀䙀耨ᖅꕀᄡ◛㙀ᖠ䡀ቨߘᖐ䙀䛀■亐▧觩ҩᑾ沂ݭ珠曤Ҥ□ҩዠ骀ݭ珠晡峠▻ꌬݢ㚫㝀潠ᖀᏀ㚡▩⠈暡邤陠◅婿檶Ҡ䚼ҫ㙀⠀杤䙴亂Ⴇ佳晠䛕盂㞸ҡሰԌ晢䙂䅁ቨԄң噰㛀ጠᒶႠ■䭀䙂ҩ䙈◠ᄈႤᖋ䙁姐ႠႤᎬቤ㙀㚂ⵄҴ◃伀ᖀ䙁㩁Һ躀㶂ҩ䙈㻃ݠ衠㠜檠㦠㙁Ҡ晢屢ҥ瘠䙯颐ቩᇬ橠䩀㙀㚇ⵈ㙃噰ݠݣ黫虠⻀楤Ҥ㙉艨㺀ځ芦噠⍠䛂Ңᖡ竣曬虠ᖑҡ婀▫ꌬݢ䚫㝁⚠ᖀ䩐➐ڠ晤䙁䅁ᛈڄң噰曠ᘃ勭虠⻀柤Ԅ⺤嵠ڬቨ㙁㚂ⵂᖐڙ习ᘀ䙀䛾㤃䙄Ҥ亂Ⴄ▾⤠ҰҰ嘉㩐㧠柀橠歭Ұң蟀ޓ繡Ҡ癤ԁҰڋ䙀ᖑᔊᖑ鋪ᗀ㙀熠Ҩ㡇⠈㰙⠈暀Ұڄ⬡霒ҡҤ䚖㕋㙀■䡅䛲㹈ᨼᘀ䙀䛀橤檠㪐蹡Ҥ䜨㚞⋀■䩀Ⴆ鼰勠ቶ䵀㙀■ᛀ䚄▫櫠ᑤ杢彻ݡᖀበ⥑■晠乢ዠ暼洠䚀罐ҩڀځድ⠀晨眰Ⴀހᖀ䡀䣆晨Ңڠ纹Ҥᑾጠ㙀⠀曤䙔仈ݠݢ☊㩁ұ䟠በ☠㹬㱼Ң䙐ڐ嗩皤ႠݠᏂᖠႨ㬈晡癰繠勠Ҷ䥀㙁■歠䚄⪓欸ᖈ䙀㙀皠咦蚀䝀ݠᑔ䙁䅁Ң訠በႠᛄ⎄屢ተҨԍ䡠Ⴀހᖈ条彻ݡᅃ㙐⪙Ҡ癤㙢ݢ䘈Ԁ硠ቨ砈癤ҫᣉҰ䙈㟒Ңᖅ錶䙀䛏矦蟂虢ҡҥቢ颖Ⴂ■ᖀ㳢ҩ繨Ҷ䉀㙀灠楨䎉㱀Ⴄ⡀ᄡ㑵⠀晥Ԁ蛨⪠㱠ԀҰښ溏鴄□ҥ終⤌ҰҨԄԂҸ暄㱖Ԁݢ㙈Ңڠ纸扠晠条恱Ұ䙄Ҧ臰劰ڀԈႠ■䩀Ꮐ㙡䙈㹢ႠᣈҨԄҢ晰ݠڐቨ▣椢ҤҢҨ暨㱚ԀҴݠᖀ㝁偨Ԍ䱀䙀䜔䤰Ҧ蚀䝀ݠᎬበᣆ晨ҥ癠䡈➅ቢ鱫■■䩀Ꮐ㙁Ҡ癤ᖐᔅ棠◀በᓙҡ衶⤀㙀⥀ݨ㙷⠨劐ڀԀހ朼洠䚀终ݠڐበ㙀⠀曭䛰蹡Ҡ癤Ԁݨᣐ䙁址Ⴀހᖀ䁃䙆Ң虡圐Ⴀߔᖀ䙁▬ᑂ虤Ң湸ݠዠ㹋ᣀ■ᗠ⍂䙁⪠㱸Ԁݴݦ◜☜Ңᗀ晢杼孴ݠᛀ䜁▸Ԍ㩀䙀㩁Ⴐ啮㛰癡Ҡ癤ᗁޘ椢晤Ң晰坤ᑢ⤊ҰҪځ橰⨰勄ڀԀހ蚄鹠Ꮐ㙁□ተ䙀⻈晠ҡ困Ⴀݠዠ奠ᣄ晨ҤұᆐԌ㡀䙀㙀橬䙁因Ⴀݠዠ䭋ᛀ■ᖀ㡀㛀芌㑀䙀㙀胢蝀በႠᦌ㱎ԀԀ桺柀院Ңᨡ究Ⳁ䞩䚧䈘䊟距䠼㱚ڂ汒恅撷⚝搣ꋌ䁀楎鷓鵓㰲䓎噠剬Ң⤋韩ڀ◐▬Ҡ嗄䩆ҠҠҠҠ㙀Ҡ㙀Ҡ迎庚荨♎䵦ꈲ䯹錢鋉塰䋜钬奖覫♙譆Ҡ㡀ᖀᄠҠݠҠԆҠԐ荽Ⰽ絧䝃砜木迖嬒㾈⬏㡇禋瀝㤜鳁岔罨㑈綇㦻满煐诃愚䂛獄⏖䇓谡躨ҰҥҠҤҠҡ蹠Ҡ䩀■ᏀҠᐰҠڌҠԄҨҢ晠ң蹠ҠꊠҠ㡀ᖀᄠҠቨҠԀҠҲҤҡ䙀Ң㹀Ҡ习Ҡ䕀ҠҠݠҠҠ߈ҨҠ䙀ңᆉ漬車岗䉜纸狌沶埛瀵赈規妒玸沆岣堡毸諊诅䅚㐍⬌禃熁茰霦岕園㼙⏆㲣堫㫽缲裒圙䒋鋍鶆俛琩沾駌嬑羫鎎沷㞳瀬ҡ鉠■㧀Ҡ⛠习ڔҠҠҠҸ哮沶釣盡輾䚤嬛䂙Ⰴᰇ潣迵謾嗈帖羫錎泦凳簔蒼见従舫钬糖燻砩颾駒執耺哭␖㞳㇝肺埅堑珬涇㲆㠋㯌雄妏媒葫䱅覢韹搭謦嗌嬑⦼瓀⋐☠ᄨҠ߇Ҡҩ䙀Ҧ湨晡䩀Ҡ觠Ҡ◀ҠԈҠҨҠҢҠҠ虠ң᧭贪飔嬗臨Ⲍ㳖見㜨木駔㵶㾛步㡃顉ል謦哌夗⠊䰭⎖醉揵輰诒愖爫狌㵦懙搩焮迓悙䒋铎䱲ꇛ䰑睊袎堗膫䱬粖㿱潄館袙夑瑬泅鲇爃㫵輾闌忶牫泅襲ꈻ濬蔸迂㵹䌀Ҡᄠ㛀ᅄҠҩҠҡ䙀ҠҠҠ蕄鯓悑爹猆粃✻㜘雂貒䃲羭泦馦㥩潅滎媘埻ⵘ勬岣濫㼘餪嗌嬑䋘咯㤶䆻濴蕆飃㷹腺勌祖釛㛹譆Ҡڂݤҩ癠Ң艬Ҡ⚠Ҡ⩚㐭粲ꇋ码煄鯍㷗㼘咬鵒ꈳ㯝祆髒拷茼狅鳖爃䠕檼觏島犹勌姃㠉诱櫒诃䉙ⲋ铌嶇燣眔蚼墎㹗茼狅鶆ꈋ䰠荄饠顡ᖀ⣠ҠጰҠԄҠڲݤҪ陠Ң湠Ҡ䑀Ҡ彠桠ᡐҠᇼҠұҠԙڂҥ幠ҡ橠Ҡ㷀ҠҠҠᅛ瀵赈規妒玸沆岣堡毸諊诅䅚㐍⬌禃熁茰霦岕園㼙⏆㲣堫㫽缲裒圙䒋鋍鶆俛琩沾駌嬑羫鐍鲢駳牠ҡң■㦀Ҡᡐ㹀ԄҠډ嶛㺛ⴌ歗刃栵軸诎婓ጺ眕賛臷琘黕鮯礟竣炑泠匽嗆ᰞ䀍隍爺㐭粲ꇋ码煄鯍㷗㼘咬鵒ꈳ㯝祆髒拷茼狅鳖爃䠕檼觏島犹勌姃㠉诱櫒诃䉙ⲋ銭浖䆙審鄬賅彶牫浅覒ꈻ濬蔸迂㵹䌀በ杠ᑘҠႪҠҤ晠ҢځҢ鉠ҡ■ҠᙀҠႠ䛀ᅌҠݬҠҥ虠ҡԀ晡屠Ҡ㩀ҠᇠҠݠ㚀ޖҠһҠҡ㙀Ҡ䩀ҠᖀҠႠҠހҠԌҠҬҠҸ銍洦冁ᆁ䔠髉帗㓎甍跗㥋最礠䚯嵰㺈⪩赖馋ݡ錢鋕外羻呎䷲ᒋ堑蔦蟔嬗臨㐬衢ᒓ谱煆䚦圔腹勡䙀▘㚀ԊҠҪᄤҡ虠ң堅歄蟒拷茽⭅鶗㥙揥缸闃㵹䌍ނҡ晠ҡ㡂ҠᘀҠ⻍㱧㥋灄蕆髄㷹苸豎ᯖ馫㇍礼趎徙絡䡀ሀҠႸᖀҿҠҷނҡ虠ҡ㑄Ҡ㕀ҠᇠҠڠҠҨҠҧҠҡ㙀Ҡ䙀ҠᖀҠᕀҠႠҠڀҠҤҠҤ䙀ҡ㙀Ҡ㡀ҠᖀҠݠҠݸҠԈҠҪ晠Ҡ晠Ҡ㙀Ҡ㱀Ҡ᧠ҠᆀҠڔҠҠҠҠ䙀ҡ湠ҡ缲裒圙䒋銍洦ꆹ搭謦嗒圛總猌奇㧛⻅蜢觉悜湻锬綆姃搼ҠԄᒈҤ䙀Ҡ暐晠幠ҠᏁҠހҠᒉᆙ蕄鏁悚䂛獄␇㥋䰐朲鏐岒膹吮汷䦋搘杄诔愙䇙勤ᯖ靣㰉謾飌嬑䋘咯㤶⥣堝沾駒執翻哥趇㹄⪸䙀㹀Ҡ㮀晠ሀҠڸҠҠҠҠ䙀ҡ鹠ҡ礼諅扰䈝哤⎖坣❝鄼諓䍐䍚Ⰴ⍦凑ᇥ負䚢愚▽Ⳍ硦燓㟕隠迓㙀ԏ߂ҢҠң幬㙀⚠Ҡ㇌㶆䆃㰌棚掝圙茹咮泶ꈑᆙ椲鋅塽▸ᛍ沶威ݡ謲跈恴繢橤⍦冓睈朠蚌ᛐ䋚卍␃督ᆀ骠Ҡҥ栤ң㙀ҡ㙜䙀㡀Ҡ⻁衠߀ҠႨ㑠ңҠҸҠҠ纘晠塠Ҡ㡃橠ጠҠᇰ䊀ҸҠԔሄҠ㙀ҡ軠ҡ剦■ҠҠ♠廠ҨҠԐ扸⪬ᰆᒣᆙ朰蛊嚖㹛牮ᯇ㥓ᆉ欤諂妑䁘玬䴆㦳➁歄諀墑㽙⭌貦榃俱缨铄庒䋙牬貆妃㿙猰賊妖㿛献⇧㦃ᇡ欰諈妔䁚ⵍ⍦槓䠁睄郀宑䃙ⵌ贆榳倉缴铊底䋛⪭沆覃培缰鋊岖䅛珮⍧㦳ᇹ欼諎妗䁛玭账駓怡荄雀庑䉙㑌赦槣倡罀铐庘䋜牮䱧㥣濹謰飊徖䋛璮⏇㵦⥳䏔杆髁徚►听沷条ᇽ酈䚯奰䋘听鲲ᒳ搨杆鋉堒湻錤⍦凓䐑皠Ҡ孤ᖀጠҠᕠ䚀ڄҠԖ䂘璬㵧濛㇝謪嗓徑爼鏭㱶俛䯹漪麎徙暌Ⴂҡ鹠Ҡ蹠ҠᏀҠ㒌㴦憉ᆕ茨䚩嶒㾞ᖜݡҠ晠Ҡꊨ■☠Ҡ⤀曠ڼҠډҠҡ䙀ҧ䆣䯍炠迎墒葨㒮汷㧣狡楈䙠垚荨Ⰽ貧㽃᧰晠㙉■ᣀҠᎠ滠ԔҠސᖈҧ虠ҥ虠Ҡ⠀Ҡ䣹䋛钠═燣瀝潊觅徙曢⻌㴦戋ᣝ灢ᗒ愙荠ᆎ⏆ꆻ㰍贪認垜朡咮綗䥘鬤苌垎㹐⠙猆粃✻㜘隠墐㽙⥌⍅祳枨䀝椸飕忣⪫沇㤣ڣ菥贺参嬗㽙錍螃ᅑ漘雄䙨䃜瑮⇬籶䅉ɇ";

const wasmBinary = base32768.decode(base32768WASM);

scryptPromise = WebAssembly.instantiate(wasmBinary, {}).then(instantiatedModule => {
  const wasm = instantiatedModule.instance.exports;

  
  let WASM_VECTOR_LEN = 0;
  
  let cachedUint8Memory0 = new Uint8Array();
  
  function getUint8Memory0() {
      if (cachedUint8Memory0.byteLength === 0) {
          cachedUint8Memory0 = new Uint8Array(wasm.memory.buffer);
      }
      return cachedUint8Memory0;
  }
  
  const lTextEncoder = typeof TextEncoder === 'undefined' ? (0, module.require)('util').TextEncoder : TextEncoder;
  
  let cachedTextEncoder = new lTextEncoder('utf-8');
  
  const encodeString = (typeof cachedTextEncoder.encodeInto === 'function'
      ? function (arg, view) {
      return cachedTextEncoder.encodeInto(arg, view);
  }
      : function (arg, view) {
      const buf = cachedTextEncoder.encode(arg);
      view.set(buf);
      return {
          read: arg.length,
          written: buf.length
      };
  });
  
  function passStringToWasm0(arg, malloc, realloc) {
  
      if (realloc === undefined) {
          const buf = cachedTextEncoder.encode(arg);
          const ptr = malloc(buf.length);
          getUint8Memory0().subarray(ptr, ptr + buf.length).set(buf);
          WASM_VECTOR_LEN = buf.length;
          return ptr;
      }
  
      let len = arg.length;
      let ptr = malloc(len);
  
      const mem = getUint8Memory0();
  
      let offset = 0;
  
      for (; offset < len; offset++) {
          const code = arg.charCodeAt(offset);
          if (code > 0x7F) break;
          mem[ptr + offset] = code;
      }
  
      if (offset !== len) {
          if (offset !== 0) {
              arg = arg.slice(offset);
          }
          ptr = realloc(ptr, len, len = offset + arg.length * 3);
          const view = getUint8Memory0().subarray(ptr + offset, ptr + len);
          const ret = encodeString(arg, view);
  
          offset += ret.written;
      }
  
      WASM_VECTOR_LEN = offset;
      return ptr;
  }
  
  let cachedInt32Memory0 = new Int32Array();
  
  function getInt32Memory0() {
      if (cachedInt32Memory0.byteLength === 0) {
          cachedInt32Memory0 = new Int32Array(wasm.memory.buffer);
      }
      return cachedInt32Memory0;
  }
  
  const lTextDecoder = typeof TextDecoder === 'undefined' ? (0, module.require)('util').TextDecoder : TextDecoder;
  
  let cachedTextDecoder = new lTextDecoder('utf-8', { ignoreBOM: true, fatal: true });
  
  cachedTextDecoder.decode();
  
  function getStringFromWasm0(ptr, len) {
      return cachedTextDecoder.decode(getUint8Memory0().subarray(ptr, ptr + len));
  }
  /**
  * @param {string} password
  * @param {string} salt
  * @param {number} n
  * @param {number} r
  * @param {number} p
  * @param {number} dklen
  * @returns {string}
  */
  scrypt = function(password, salt, n, r, p, dklen) {
      try {
          const retptr = wasm.__wbindgen_add_to_stack_pointer(-16);
          const ptr0 = passStringToWasm0(password, wasm.__wbindgen_malloc, wasm.__wbindgen_realloc);
          const len0 = WASM_VECTOR_LEN;
          const ptr1 = passStringToWasm0(salt, wasm.__wbindgen_malloc, wasm.__wbindgen_realloc);
          const len1 = WASM_VECTOR_LEN;
          wasm.scrypt(retptr, ptr0, len0, ptr1, len1, n, r, p, dklen);
          var r0 = getInt32Memory0()[retptr / 4 + 0];
          var r1 = getInt32Memory0()[retptr / 4 + 1];
          return getStringFromWasm0(r0, r1);
      } finally {
          wasm.__wbindgen_add_to_stack_pointer(16);
          wasm.__wbindgen_free(r0, r1);
      }
  }
  
  const u32CvtShim = new Uint32Array(2);
  
  const uint64CvtShim = new BigUint64Array(u32CvtShim.buffer);
  /**
  * @param {bigint} start
  * @param {bigint} end
  * @param {number} difficulty
  * @param {string} salt
  * @param {number} n
  * @param {number} r
  * @param {number} p
  * @param {number} dklen
  * @returns {string}
  */
  mine = function(start, end, difficulty, salt, n, r, p, dklen) {
      try {
          const retptr = wasm.__wbindgen_add_to_stack_pointer(-16);
          uint64CvtShim[0] = start;
          const low0 = u32CvtShim[0];
          const high0 = u32CvtShim[1];
          uint64CvtShim[0] = end;
          const low1 = u32CvtShim[0];
          const high1 = u32CvtShim[1];
          const ptr2 = passStringToWasm0(salt, wasm.__wbindgen_malloc, wasm.__wbindgen_realloc);
          const len2 = WASM_VECTOR_LEN;
          wasm.mine(retptr, low0, high0, low1, high1, difficulty, ptr2, len2, n, r, p, dklen);
          var r0 = getInt32Memory0()[retptr / 4 + 0];
          var r1 = getInt32Memory0()[retptr / 4 + 1];
          return getStringFromWasm0(r0, r1);
      } finally {
          wasm.__wbindgen_add_to_stack_pointer(16);
          wasm.__wbindgen_free(r0, r1);
      }
  }
  
  
});
